#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныйПрофиль = Параметры.ВыбранныйПрофиль;
	ЗаполнитьТаблицуРолей();
	
	НаименованиеВыбранногоПрофиля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранныйПрофиль, "Наименование");
	НаименованиеНовогоПрофиля = НаименованиеВыбранногоПрофиля + " (Исключенные роли (см. комментарий))";
	
	КомментарийНовогоПрофиля = "Профиль создан копированием профиля [" + НаименованиеВыбранногоПрофиля + "], за исключением ролей:";
	
	АвтоматическоеФормирование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаРолейВыбранногоПрофиляПометкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаРолейВыбранногоПрофиля.ТекущиеДанные;
	Если ТекДанные = Неопределено Или НЕ АвтоматическоеФормирование Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Пометка Тогда
		ПоследнийНомер = НайтиПоследнийНомерРолиВТексте();
		
		КомментарийНовогоПрофиля = КомментарийНовогоПрофиля 
							     + ?(Прав(КомментарийНовогоПрофиля, 1) = Символы.ПС, "", Символы.ПС) 
								 + Символы.Таб + Строка(ПоследнийНомер) + ") " 
								 + ТекДанные.Синоним;
	Иначе
		СтрокаЗаменена = Ложь;
		Для Счетчик = 1 По СтрЧислоСтрок(КомментарийНовогоПрофиля) Цикл
			ТекСтрока = СтрПолучитьСтроку(КомментарийНовогоПрофиля, Счетчик);
			Если НЕ СтрокаЗаменена И СтрНайти(ТекСтрока, ТекДанные.Синоним) Тогда            
				НомерСимволаДоТекСтроки = СтрНайти(КомментарийНовогоПрофиля, ТекСтрока);
				
				ОбщийПоследнийНомер = НайтиПоследнийНомерРолиВТексте();
				
				КомментарийНовогоПрофиля = СтрЗаменить(КомментарийНовогоПрофиля, ТекСтрока, "");
				ПраваяЧастьКомментария   = Сред(КомментарийНовогоПрофиля, НомерСимволаДоТекСтроки + 1); 
				КомментарийНовогоПрофиля = Лев(КомментарийНовогоПрофиля, НомерСимволаДоТекСтроки - 2); 
												
				ПоследнийНомер = НайтиПоследнийНомерРолиВТексте();
				
				СтрокаЗаменена = Истина;
			КонецЕсли;                  
			
			Если СтрокаЗаменена Тогда
				Для Счетчик = 1 По СтрЧислоСтрок(ПраваяЧастьКомментария) Цикл
					ТекСтрока = СтрПолучитьСтроку(ПраваяЧастьКомментария, Счетчик);
					
					НоваяЧастьСтроки = СтрЗаменить(ТекСтрока, Строка(ПоследнийНомер + 1), ПоследнийНомер);
					КомментарийНовогоПрофиля = КомментарийНовогоПрофиля 
											 + ?(Прав(КомментарийНовогоПрофиля, 1) = Символы.ПС, "", Символы.ПС) 
											 + НоваяЧастьСтроки; 
					ПоследнийНомер = ПоследнийНомер + 1;
				КонецЦикла; 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеФормированиеПриИзменении(Элемент)
	
	Элементы.КомментарийНовогоПрофиля.ТолькоПросмотр = АвтоматическоеФормирование;
	
	Если АвтоматическоеФормирование Тогда
		КомментарийНовогоПрофиля = "Профиль создан копированием профиля [" + Строка(ВыбранныйПрофиль) + "], за исключением ролей:";
		
		Для Каждого Строка Из ТаблицаРолейВыбранногоПрофиля Цикл
			Если Строка.Пометка Тогда
				ПоследнийНомер = НайтиПоследнийНомерРолиВТексте();
				КомментарийНовогоПрофиля = КомментарийНовогоПрофиля + Символы.ПС + Символы.Таб + Строка(ПоследнийНомер) + ") " + Строка.Синоним;
			КонецЕсли;
		КонецЦикла;
	Иначе
		КомментарийНовогоПрофиля = "";		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовыйПрофиль(Команда)
	
	СоздатьНовыйПрофильНаСервере(ВыбранныйПрофиль, КомментарийНовогоПрофиля, НаименованиеНовогоПрофиля, ТаблицаРолейВыбранногоПрофиля);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	
	ПараметрыОтбора = Новый Структура("Пометка", Истина);
	НайденныеСтроки = ТаблицаРолейВыбранногоПрофиля.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуРолей()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрофилиГруппДоступаРоли.Роль КАК Роль,
	|	ПрофилиГруппДоступаРоли.Роль.Наименование КАК Синоним
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Ссылка = &ВыбранныйПрофиль";
	Запрос.УстановитьПараметр("ВыбранныйПрофиль", ВыбранныйПрофиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРолейВыбранногоПрофиля.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПоследнийНомерРолиВТексте()

	НомерРоли = 0;
	Для Счетчик = 1 По СтрЧислоСтрок(КомментарийНовогоПрофиля) Цикл
		ТекСтрока = СтрПолучитьСтроку(КомментарийНовогоПрофиля, Счетчик);
		
		А = Счетчик;
		Для Сч = Счетчик - 1 По А + 5 Цикл
			Если Сч = 0 Тогда
				НомерРоли = 1;
				Прервать;
			Иначе
				Если СтрНайти(ТекСтрока, Строка(Сч) + ")") Тогда
					НомерРоли = Сч + 1;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;  
	
	Возврат НомерРоли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьНовыйПрофильНаСервере(ВыбранныйПрофиль, Комментарий, Наименование, Знач ТаблицаРолейИсключения)
	
	ЗаполняемыеРеквизиты = Новый Структура("Наименование, Комментарий", Наименование, Комментарий); 
	НовыйПрофиль = СоздатьПолнуюКопиюЭлементаСправочника(ВыбранныйПрофиль, "Код", ЗаполняемыеРеквизиты, ТаблицаРолейИсключения);	
	
	Если НЕ НовыйПрофиль = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Роль была успешно создана.");	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьПолнуюКопиюЭлементаСправочника(Ссылка, ИсключаяРеквизиты = "", стрНовыеРеквизиты = "", ТаблицаРолейИсключения)
    
    НачатьТранзакцию();
    
    //Если нет владельцев тогда не присваиваем этот реквизит при копировании
    Если Ссылка.Метаданные().Владельцы.Количество() = 0 и Найти(ИсключаяРеквизиты , "Владелец") = 0 Тогда
        ИсключаяРеквизиты = ИсключаяРеквизиты + ",Владелец";
    КонецЕсли;
    
    //Если не иерархический, но забыли исключить родителя
    Если НЕ Ссылка.Метаданные().Иерархический и Найти(ИсключаяРеквизиты , "Родитель") = 0 Тогда
        ИсключаяРеквизиты = ИсключаяРеквизиты + ",Родитель";
    КонецЕсли;    
    
    //Если забыли исключить реквизиты доступные только для групп добавим в исключения и их
    Для Каждого Реквизит Из Ссылка.Метаданные().Реквизиты Цикл
        Если Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Найти(ИсключаяРеквизиты , Реквизит.Имя) = 0 Тогда
            ИсключаяРеквизиты = ИсключаяРеквизиты + "," + Реквизит.Имя;    
        КонецЕсли;
    КонецЦикла;
    
    //Формируем список подчиненных справочников и массив их типов
    спПодчиненныхСправочников = Новый Массив;
    мТиповПодчиненныхСправочников = Новый Массив;
    Для Каждого Спр Из Метаданные.Справочники Цикл
        Если Спр.Владельцы.Содержит(Ссылка.Метаданные()) Тогда
            спПодчиненныхСправочников.Добавить(Спр.Имя);
            мТиповПодчиненныхСправочников.Добавить(Тип("СправочникСсылка." + Спр.Имя));
        КонецЕсли;
    КонецЦикла;
    
    //Регистры сведений. Только там где наш элемент копирования может быть ведущим измерением. Запоминаем названия регистров и имена измерений.
    спРегистровСведений = Новый Соответствие;
    Для Каждого Рег Из МЕтаданные.РегистрыСведений Цикл        
        Для Каждого Измерение Из Рег.Измерения Цикл
            Если Измерение.Тип.СодержитТип(Тип("СправочникСсылка." + Ссылка.Метаданные().Имя)) И Измерение.Ведущее Тогда
                спРегистровСведений.Вставить(Рег.Имя, Рег.Измерения.Индекс(Измерение)); Прервать;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    //Копируем необычно, чтобы легко исключить требуемые реквизиты 
    КопияСсылки = Справочники[Ссылка.Метаданные().Имя].СоздатьЭлемент();
    ЗаполнитьЗначенияСвойств(КопияСсылки, Ссылка,,ИсключаяРеквизиты);
	
	//Копируем все табличные части
	Для Каждого ТабличнаяЧасть Из Ссылка.Метаданные().ТабличныеЧасти Цикл
		Для Каждого СтрокаТабличнойЧасти Из Ссылка[ТабличнаяЧасть.Имя] Цикл  
			
			Если ТабличнаяЧасть.Имя = "Роли" Тогда
				ПараметрыОтбора = Новый Структура("Роль", СтрокаТабличнойЧасти.Роль);
				НайденныеСтроки = ТаблицаРолейИсключения.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда Продолжить; КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(КопияСсылки[ТабличнаяЧасть.Имя].Добавить(), СтрокаТабличнойЧасти);
		КонецЦикла;
	КонецЦикла;
	
    //Если нужно присвоим нужные значения нужным реквизитам копии.
    Если ТипЗнч(стрНовыеРеквизиты) = Тип("Структура") Тогда
        ЗаполнитьЗначенияСвойств(КопияСсылки,стрНовыеРеквизиты);    
    КонецЕсли;

    //Очищаем значения подчиненных справочников ибо они не могут принадлежать новому владельцу (копии старого)
    Для Каждого Реквизит Из КопияСсылки.Метаданные().Реквизиты Цикл
        Если Не мТиповПодчиненныхСправочников.Найти(ТипЗнч(КопияСсылки[Реквизит.Имя])) = Неопределено Тогда
            КопияСсылки[Реквизит.Имя] = Неопределено;    
        КонецЕсли;
    КонецЦикла;
    
    //Теперь запишется:)
    КопияСсылки.Записать();
    
    //ТЗ. Сложим сюда старые значения подчиненных справочников и соответствующие им новые, для нашей копии
    тСинхронизацииРеквизитов = Новый ТаблицаЗначений;
    тСинхронизацииРеквизитов.Колонки.Добавить("СтароеЗначение");
    тСинхронизацииРеквизитов.Колонки.Добавить("НовоеЗначение");
    
    //А теперь создадим новые подчиненные элементы копированием и сопоставим их имеющимся у объекта копирования
    Для Каждого ПодчиненныйСправочник Из спПодчиненныхСправочников Цикл
        ВыборкаИзПодчиненногоСправочника = Справочники[ПодчиненныйСправочник].Выбрать(,Ссылка);
        Пока ВыборкаИзПодчиненногоСправочника.Следующий() Цикл
            ЗаписьСинхронизации = тСинхронизацииРеквизитов.Добавить();
            НовыйПодчиненныйЭлемент = ВыборкаИзПодчиненногоСправочника.Ссылка.Скопировать();
            НовыйПодчиненныйЭлемент.Владелец = КопияСсылки.Ссылка;
            НовыйПодчиненныйЭлемент.Записать();
            ЗаписьСинхронизации.СтароеЗначение = ВыборкаИзПодчиненногоСправочника.Ссылка;
            ЗаписьСинхронизации.НовоеЗначение  = НовыйПодчиненныйЭлемент.Ссылка;
        КонецЦикла;
    КонецЦикла;
    
    //Присвоим копии элемента копии значений подчиненных справочников 
    Для Каждого Реквизит Из Ссылка.Метаданные().Реквизиты Цикл
        Если Не мТиповПодчиненныхСправочников.Найти(ТипЗнч(КопияСсылки[Реквизит.Имя])) = Неопределено Тогда
            НайденныйРеквизитСоответствия = тСинхронизацииРеквизитов.Найти(Ссылка[Реквизит.Имя],"СтароеЗначение");
            Если НЕ НайденныйРеквизитСоответствия = Неопределено 
                И Найти(ИсключаяРеквизиты, Реквизит.Имя) = 0 Тогда
                КопияСсылки[Реквизит.Имя] = НайденныйРеквизитСоответствия.НовоеЗначение;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    //Снова запишемся перед записью регистров 
    КопияСсылки.Записать();
    
    //Регистры сведений, содержащие измерением копируемый элемент
    Для Каждого Регистр Из спРегистровСведений Цикл
        РегистрМетаданные = Метаданные.РегистрыСведений.Найти(Регистр.Ключ);
        ИмяИзмерения = РегистрМетаданные.Измерения.Получить(Регистр.Значение).Имя;
        //Только независимые, ибо копировать еще и регистраторы это уже слишком!
        Если РегистрМетаданные.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
            
            Если РегистрМетаданные.ПериодичностьРегистраСведений  = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
                РегистрВыборка = РегистрыСведений[Регистр.Ключ].Выбрать(Новый Структура(ИмяИзмерения, Ссылка));//Непериодические
            Иначе
                РегистрВыборка = РегистрыСведений[Регистр.Ключ].Выбрать(,,Новый Структура(ИмяИзмерения, Ссылка));//Периодические
            КонецЕсли;
            
            НаборЗаписей = РегистрыСведений[Регистр.Ключ].СоздатьНаборЗаписей();
            НаборЗаписей.Отбор[ИмяИзмерения].Установить(КопияСсылки.Ссылка);
            
            Пока РегистрВыборка.Следующий() Цикл
                //Если в выборке есть записи с копируемым элементом скопируем ее для его копии
                НоваяЗапись = НаборЗаписей.Добавить();
                ЗаполнитьЗначенияСвойств(НоваяЗапись, РегистрВыборка,,ИмяИзмерения);
                НоваяЗапись[ИмяИзмерения] = КопияСсылки.Ссылка; //А сюда подставим копию.
            КонецЦикла;
            
            Если НаборЗаписей.Количество()>0 Тогда
                НаборЗаписей.Записать();
            КонецЕсли;
            
        КонецЕсли;
        
    КонецЦикла;
    
    ЗафиксироватьТранзакцию();
    
    Возврат КопияСсылки.Ссылка;
    
КонецФункции

#КонецОбласти   






