
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПериодПоискаОшибок.ДатаНачала) Тогда 
		
		ПериодПоискаОшибок.ДатаНачала 	 = ТекущаяДатаСеанса();
		ПериодПоискаОшибок.ДатаОкончания = КонецДня(ПериодПоискаОшибок.ДатаНачала); 
		
	КонецЕсли;
	
	СтруктураЦвета = Новый Структура;
	СтруктураЦвета.Вставить("Зеленый", WebЦвета.Зеленый);
	СтруктураЦвета.Вставить("Красный", WebЦвета.Красный);
	
	Параметры.Свойство("СворачиватьТаблицуПрофилейПриОткрытии", СворачиватьТаблицуПрофилейПриОткрытии); 
	Параметры.Свойство("ПоказыватьОрганизациюИДолжность", 		ПоказыватьОрганизациюИДолжность);   
	Параметры.Свойство("УведомлятьОбОшибкахПриОткрытии", 		УведомлятьОбОшибкахПриОткрытии);
	Параметры.Свойство("ИспользуетсяТерминальныйРежим", 		ИспользуетсяТерминальныйРежим);
	Параметры.Свойство("ИспользоватьАвтоПоискОшибок",			ИспользоватьАвтоПоискОшибок);
	Параметры.Свойство("ДинамическийПериодПоиска", 				ДинамическийПериодПоиска);
	Параметры.Свойство("ПутьДоПользователей", 					ПутьДоПользователей);  
	Параметры.Свойство("ПериодПоискаОшибок", 					ПериодПоискаОшибок);
	Параметры.Свойство("СписокМетаданных", 						СписокМетаданных);
	
	ТекущийПериод = ?(ДинамическийПериодПоиска, ТекущаяДата(), ПредставлениеПериода(ПериодПоискаОшибок.ДатаНачала, ПериодПоискаОшибок.ДатаОкончания));
		
	Элементы.ГруппаПериод.Видимость 				   = ?(ИспользоватьАвтоПоискОшибок, Истина, Ложь); 
	Элементы.УведомлятьОбОшибкахПриОткрытии.Видимость  = ?(ИспользоватьАвтоПоискОшибок, Истина, Ложь);
	
	Элементы.ГруппаПериод.Видимость 				   = ?(ДинамическийПериодПоиска, Ложь, Истина); 
	
	Элементы.ПоказыватьОрганизациюИДолжность.Видимость = НЕ Параметры.ИмяКонфигурации = "УТ";
	
	ПоказыватьОрганизациюИДолжность = ?(ПоказыватьОрганизациюИДолжность, Элементы.ПоказыватьОрганизациюИДолжность.Видимость, Ложь);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	УстановитьЦветТекста();
	
	Если ЗначениеЗаполнено(ПутьДоПользователей) Тогда
		ПрименениеПути();
	Иначе
		ОчисткаПути();
	КонецЕсли;
	
	Элементы.ГруппаПутьНаТерминальныйСервер.Видимость = ?(ИспользуетсяТерминальныйРежим, Истина, Ложь);
	
КонецПроцедуры          

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("СворачиватьТаблицуПрофилейПриОткрытии", СворачиватьТаблицуПрофилейПриОткрытии);
	СтруктураЗакрытия.Вставить("ПоказыватьОрганизациюИДолжность",		ПоказыватьОрганизациюИДолжность);
	СтруктураЗакрытия.Вставить("УведомлятьОбОшибкахПриОткрытии", 		УведомлятьОбОшибкахПриОткрытии);
	СтруктураЗакрытия.Вставить("ИспользуетсяТерминальныйРежим", 		ИспользуетсяТерминальныйРежим);  
	СтруктураЗакрытия.Вставить("ИспользоватьАвтоПоискОшибок", 			ИспользоватьАвтоПоискОшибок);
	СтруктураЗакрытия.Вставить("ДинамическийПериодПоиска", 				ДинамическийПериодПоиска);
	СтруктураЗакрытия.Вставить("ПутьДоПользователей", 					ПутьДоПользователей);   
	СтруктураЗакрытия.Вставить("ПериодПоискаОшибок", 					ПериодПоискаОшибок);
	СтруктураЗакрытия.Вставить("СписокМетаданных", 						СписокМетаданных);  
	                           
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьСнятьВсе(Команда)
	
	Для Каждого Строка Из ВидыНастроек Цикл		
		Строка.Пометка = ?(Команда.Имя = "ОтметитьВсе", Истина, Ложь);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСписокМетаданных(Команда)

	СписокМетаданных.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ПослеВыбораМетаданных", ЭтотОбъект), "Выберите метаданнные для отражения в дереве");
	
КонецПроцедуры                     

&НаКлиенте
Процедура ПересчитатьПраваРолей(Команда)
	
	ЕстьИзменения = Ложь;
	
	ОбновитьДанныеРегистраНаСервере(Команда.Имя, ЕстьИзменения);
	
	Если ЕстьИзменения Тогда
		Текст = НСтр("ru = 'Обновление выполнено успешно.'");
	Иначе
		Текст = НСтр("ru = 'Обновление не требуется.'");
	КонецЕсли;
	
	ПоказатьПредупреждение(, Текст);
	
КонецПроцедуры    

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПрименитьПуть(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьДоПользователей) Тогда
		
		ПоказатьПредупреждение(, "Укажите адрес терминального сервера, например:
																|Srv-terminal-1c.bamr.ru");
		Возврат;
		
	КонецЕсли;
	
	ПрименениеПути(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПуть(Команда)
	
	ОчисткаПути();		
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПериод(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("НачалоПериода", ПериодПоискаОшибок.ДатаНачала);
	ПараметрыОткрытия.Вставить("КонецПериода", ПериодПоискаОшибок.ДатаОкончания);
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораПериода", ЭтотОбъект);  
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаДень", ПараметрыОткрытия, ЭтотОбъект,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыОткрытия, ЭтотОбъект,,,, ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры       

&НаКлиенте
Процедура Справка(Команда)
	
	//ОткрытьФорму("ВнешняяОбработка.АнализИКонтрольДоступа.Форма.ФормаСправка",, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсправленныеОшибки(Команда)
	
	ОчиститьРегистрСведений("УД_ИсторияИсправленияОшибок");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы  

&НаКлиенте
Процедура ДинамическийПериодПоискаПриИзменении(Элемент)
	
	Элементы.ГруппаПериод.Видимость = НЕ ДинамическийПериодПоиска;
	
	ПараметрыДаты = Новый Структура;
	ПараметрыДаты.Вставить("НачалоПериода", ПериодПоискаОшибок.ДатаНачала);
	ПараметрыДаты.Вставить("КонецПериода", ПериодПоискаОшибок.ДатаОкончания);
	
	ПослеВыбораПериода(ПараметрыДаты, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьЦветПриИзменении(Элемент)
	
	УстановитьЦветТекста();
	
	Элементы.ГруппаПериод.Видимость = ?(ИспользоватьАвтоПоискОшибок, Истина, Ложь);
	Элементы.УведомлятьОбОшибкахПриОткрытии.Видимость = ?(ИспользоватьАвтоПоискОшибок, Истина, Ложь);
	
	ОтключитьПредупреждение(ОтключитьПредупреждениеОбОпасныхДействиях);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяТерминальныйРежимПриИзменении(Элемент)
	
	Элементы.ГруппаПутьНаТерминальныйСервер.Видимость = ?(ИспользуетсяТерминальныйРежим, Истина, Ложь);
	
	Если ИспользуетсяТерминальныйРежим Тогда
		ОчисткаПути();
	Иначе
		ПрименениеПути();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаСтраницаСправка" Тогда
		ПолучитьМакетНаСервере();	     
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораМетаданных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
	//СписокМетаданных.Очистить();
	//
	//СписокМетаданных = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветТекста()
	
	Элементы.ИспользоватьАвтоПоискОшибок.ЦветТекстаЗаголовка 			   = ?(ИспользоватьАвтоПоискОшибок, СтруктураЦвета.Зеленый, СтруктураЦвета.Красный);
	Элементы.СворачиватьТаблицуПрофилейПриОткрытии.ЦветТекстаЗаголовка     = ?(СворачиватьТаблицуПрофилейПриОткрытии, СтруктураЦвета.Зеленый, СтруктураЦвета.Красный);
	Элементы.ПоказыватьОрганизациюИДолжность.ЦветТекстаЗаголовка	  	   = ?(ПоказыватьОрганизациюИДолжность, СтруктураЦвета.Зеленый, СтруктураЦвета.Красный);
	Элементы.ОтключитьПредупреждениеОбОпасныхДействиях.ЦветТекстаЗаголовка = ?(ОтключитьПредупреждениеОбОпасныхДействиях, СтруктураЦвета.Зеленый, СтруктураЦвета.Красный); 
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьПредупреждение(Переключить)
	
	ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();	
	ТекПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = НЕ Переключить;
	ТекПользовательИБ.Записать();
		
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораПериода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
	ПериодПоискаОшибок.ДатаНачала = Результат.НачалоПериода;
	ПериодПоискаОшибок.ДатаОкончания = Результат.КонецПериода;
	
	ТекущийПериод = ПредставлениеПериода(ПериодПоискаОшибок.ДатаНачала, ПериодПоискаОшибок.ДатаОкончания);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистраНаСервере(ИмяКоманды, ЕстьИзменения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяКоманды = "ПересчитатьПраваРолей" Тогда
		РегистрыСведений.ПраваРолей.ОбновитьДанныеРегистра(ЕстьИзменения); 
		Элементы.ПересчитатьПраваРолей.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
	ИначеЕсли ИмяКоманды = "ПересчитатьЗначенияГруппДоступа" Тогда
		РегистрыСведений.ЗначенияГруппДоступа.ОбновитьДанныеРегистра(, ЕстьИзменения); 
		Элементы.ПересчитатьЗначенияГруппДоступа.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
	ИначеЕсли ИмяКоманды = "ПересчитатьТаблицыГруппДоступа" Тогда 
		РегистрыСведений.ТаблицыГруппДоступа.ОбновитьДанныеРегистра( , , ЕстьИзменения);
		Элементы.ПересчитатьТаблицыГруппДоступа.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступомСлужебный = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступомСлужебный");
		МодульУправлениеДоступомСлужебный.ОбновитьПараметрыОграниченияДоступа();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьМакетНаСервере()
	
	ПолеHTML = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет").ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименениеПути(ЭтоПрименение = Ложь)

	Элементы.ПутьДоПользователей.Вид	     = ВидПоляФормы.ПолеНадписи; 
	Элементы.ПутьДоПользователей.ЦветТекста  = WebЦвета.Зеленый; 
	Элементы.ПутьДоПользователей.Доступность = Ложь;
	Элементы.ПрименитьПуть.Видимость 		 = Ложь;
	Элементы.ОчиститьПуть.Видимость          = Истина; 
	
	АдресСервера = ПутьДоПользователей;
	
	Если ЭтоПрименение Тогда
		ПутьДоПользователей = "\\" + АдресСервера + "\c$";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчисткаПути()
	
	Элементы.ПутьДоПользователей.Вид 		 = ВидПоляФормы.ПолеВвода; 
	Элементы.ПутьДоПользователей.ЦветТекста  = WebЦвета.Черный; 
	Элементы.ПутьДоПользователей.Доступность = Истина;          
	Элементы.ПрименитьПуть.Видимость 		 = Истина;
	Элементы.ОчиститьПуть.Видимость 		 = Ложь; 
	
	ПутьДоПользователей = "";
	Элементы.ПутьДоПользователей.ПодсказкаВвода = "Укажите адрес терминального сервера";
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРегистрСведений(ИмяРегистра)
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

