#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.История) Тогда
		ЭтотОбъект.История.Загрузить(ПолучитьИзВременногоХранилища(Параметры.История));
	КонецЕсли; 
	
	Параметры.Свойство("Пользователь", Пользователь); 

	СтрокаФормат 		 = "ЧЦ=3; ЧДЦ=0; ЧФ=Ч";
	ЭтотОбъект.Индикатор = ?(История.Количество() = 0, Формат(0, СтрокаФормат), История.Количество() / 300 * 100);
	
	КоличествоЗаписейНаМоментОткрытия = История.Количество();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ КоличествоЗаписейНаМоментОткрытия = История.Количество() Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("АдресТаблицыИстории", ПолучитьАдресТаблицыИстории(История));
		
		Оповестить("ИсторияИзмененияЗакрыта", ПараметрыЗакрытия, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если История.Количество() > 99900 Тогда
		ПоказатьПредупреждение(, "Свободное место в таблице истории заканчивается. Произведите очистку.");
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(Объект, ЭтотОбъект.ВладелецФормы.Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсторияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Или Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		Элементы.ИсторияКонтекстноеМенюВключитьИсключитьИзГруппыДоступа.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Элементы.ИсторияКонтекстноеМенюВключитьИсключитьИзГруппыДоступа.Видимость = Истина;
	
	Элементы.ИсторияКонтекстноеМенюВключитьИсключитьИзГруппыДоступа.Заголовок = ?(ТекДанные.Признак = 0, 
																				"Исключить из группы доступа [" + Пользователь + "]",
																				"Включить в группу доступа [" + Пользователь + "]");
	
	Элементы.ИсторияКонтекстноеМенюВключитьИсключитьИзГруппыДоступа.Картинка = ?(ТекДанные.Признак = 0, 
																				БиблиотекаКартинок.ВнешняяКомпонентаНеДоступна, 
																				БиблиотекаКартинок.ВнешняяКомпонентаДоступна);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазвернутьФункции(Команда)
	
	Элементы.РазвернутьФункции.Видимость = Ложь;
	Элементы.ГруппаФункции.Видимость 	 = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьФункции(Команда)
	
	Элементы.ГруппаФункции.Видимость 	 = Ложь;
	Элементы.РазвернутьФункции.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПериодОчистки.ДатаНачала) И НЕ ЗначениеЗаполнено(ПериодОчистки.ДатаОкончания) Тогда
		ТекстВопроса = "Таблица истории будет полностью очищена. Продолжить?";
	Иначе
		ТекстВопроса = СтрШаблон("Таблица истории будет очищена c %1 по %2. Продолжить?", Формат(ПериодОчистки.ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(ПериодОчистки.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
		
	ОО = Новый ОписаниеОповещения("ПослеПодтвержденияОчистки", ЭтотОбъект);
	ПоказатьВопрос(ОО, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, "Подтвердите действие"); 
	
КонецПроцедуры                     

&НаКлиенте
Процедура НазначитьГруппуПользователю(Команда) 
	
	ТекДанные = Элементы.История.ТекущиеДанные; 
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьВГруппу = СтрНайти(Элементы.ИсторияКонтекстноеМенюВключитьИсключитьИзГруппыДоступа.Заголовок, "Включить") > 0;
	
	ВключитьИсключитьИзГруппы(ТекДанные.ГруппаДоступа, ВключитьВГруппу); // Включить
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПодтвержденияОчистки(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ОчиститьНаСервере();
	КонецЕсли;
	
КонецПроцедуры              

&НаСервере
Процедура ОчиститьНаСервере()
	
	История.Очистить();
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаИстории.Дата КАК Дата,
	               |	ТаблицаИстории.Пользователь КАК Пользователь,
	               |	ТаблицаИстории.ГруппаДоступа КАК ГруппаДоступа,
	               |	ТаблицаИстории.Роль КАК Роль,
				   |	ТаблицаИстории.Признак КАК Признак
	               |ПОМЕСТИТЬ ВТ_ТаблицаИстории
	               |ИЗ
	               |	&ТаблицаИстории КАК ТаблицаИстории
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////";;
	
	Запрос.УстановитьПараметр("ТаблицаИстории", История.Выгрузить());
	
КонецПроцедуры

#КонецОбласти   

#Область Разработка

&НаКлиенте
Процедура ВключитьИсключитьИзГруппы(ГруппаДоступа, ВключитьВГруппуДоступа)
	
	Если ТипЗнч(ГруппаДоступа) <> Тип("СправочникСсылка.ГруппыДоступа") ИЛИ НЕ ЗначениеЗаполнено(ГруппаДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ГруппаДоступа", ГруппаДоступа);
	ДополнительныеПараметры.Вставить("ВключитьВГруппуДоступа", ВключитьВГруппуДоступа);
	ДополнительныеПараметры.Вставить("Пользователь", Пользователь);
	
	Если СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено
	   И ГруппаДоступа = Объект.ГруппаДоступаАдминистраторы Тогда
		
		ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
			Новый ОписаниеОповещения(
				"ВключитьИсключитьИзГруппыЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			ЭтотОбъект,
			Объект.ПарольПользователяСервиса);
		Возврат;
	Иначе
		ВключитьИсключитьИзГруппыЗавершение(Null, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВключитьИсключитьИзГруппыЗавершение(НовыйПарольПользователяСервиса, ДополнительныеПараметры) Экспорт
	
	Если НовыйПарольПользователяСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыйПарольПользователяСервиса <> Null Тогда
		ПарольПользователяСервиса = НовыйПарольПользователяСервиса;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	ИзменитьСоставГруппы(ДополнительныеПараметры, ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(, ОписаниеОшибки);
	Иначе
		ОповеститьОбИзменении(ДополнительныеПараметры.ГруппаДоступа);
		Оповестить("Запись_ГруппыДоступа", Новый Структура, ДополнительныеПараметры.ГруппаДоступа); 
		ЗаписатьВТаблицуИстории(ДополнительныеПараметры.ВключитьВГруппуДоступа);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере  
Процедура ИзменитьСоставГруппы(Знач ДополнительныеПараметры, ОписаниеОшибки = "")

	ТекОбъект = РеквизитФормыВЗначение("Объект"); 
	ТекОбъект.ИзменитьСоставГруппы(ДополнительныеПараметры, ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВТаблицуИстории(ВключитьВГруппуДоступа)

	НоваяСтрока = История.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.История.ТекущиеДанные);
	
	НоваяСтрока.Дата 		 = ТекущаяДата();
	НоваяСтрока.Пользователь = Пользователь; 
	НоваяСтрока.Признак 	 = ?(ВключитьВГруппуДоступа = Истина, 0, 1);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицыИстории(Знач ТаблицаИстории)
	
	История = ДанныеФормыВЗначение(ТаблицаИстории, Тип("ТаблицаЗначений"));
	Возврат ПоместитьВоВременноеХранилище(История, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти






