
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПроверитьВозможностьЗапуска(Отказ, Объект, МассивОшибок) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") = Неопределено Тогда
		МассивОшибок.Добавить("БСП не обнаружена, работа программы прекращена");
		Отказ = Истина;
	КонецЕсли;
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	Если Число(Лев(ВерсияБСП, 1)) < 3 Тогда
		МассивОшибок.Добавить("Текущая версия БСП (" + Лев(ВерсияБСП, 3) + ") не поддерживается обработкой, требуется от (3.1) и выше.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Метаданные.Синоним, "Документооборот") > 1 Тогда
		МассивОшибок.Добавить(СтрШаблон("Работа в %1 не предусмотрена.", Метаданные));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЖурналРегистрации(ДатаНачала, ДатаОкончания, ЭтоУведомление = Ложь) Экспорт
	
	тзЖурнал = Новый ТаблицаЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", ДатаНачала);
	Отбор.Вставить("ДатаОкончания", ?(ДатаОкончания = Неопределено, ТекущаяДатаСеанса(), ДатаОкончания));
	
	Если ЭтоУведомление Тогда
		ПометкиТаблицыУровней = ПолучитьТипыОшибок();
		
		УровниЖурнала = Новый Массив;
		Если ПометкиТаблицыУровней.Первая = "Истина" Тогда
			УровниЖурнала.Добавить(УровеньЖурналаРегистрации.Информация);
		КонецЕсли;
		
		Если ПометкиТаблицыУровней.Вторая = "Истина" Тогда
			УровниЖурнала.Добавить(УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;
	КонецЕсли;
	
	СписокУровней = Новый Массив;
	Если УровниЖурнала = Неопределено Тогда
		СписокУровней.Добавить(УровеньЖурналаРегистрации.Ошибка);
		СписокУровней.Добавить(УровеньЖурналаРегистрации.Информация);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокУровней, УровниЖурнала);
	КонецЕсли;
	
	Отбор.Вставить("Уровень", СписокУровней);
	
	СписокСобытий = Новый Массив;
	СписокСобытий.Добавить("_$PerformError$_");
	СписокСобытий.Добавить("_$Access$_.AccessDenied");
	
	Отбор.Вставить("Событие", СписокСобытий);
	
	Колонки = "ПредставлениеДанных,Данные,Комментарий,ПредставлениеМетаданных,Метаданные,Компьютер,ИмяПользователя,Пользователь,ПредставлениеСобытия,Событие,ПредставлениеПриложения,Дата";
	
	ВыгрузитьЖурналРегистрации(тзЖурнал, Отбор, Колонки);
	
	ПодложкаЖурнала = СоздатьПодложкуДляЖурнала(Колонки);
	
	Для Каждого Строка Из ТзЖурнал Цикл
		НоваяСтрока = ПодложкаЖурнала.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ПредставлениеДанных КАК ПредставлениеДанных,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Компьютер КАК Компьютер,
	|	Таблица.ИмяПользователя КАК ИмяПользователя,
	|	Таблица.Пользователь КАК Пользователь,
	|	Таблица.ПредставлениеСобытия КАК ПредставлениеСобытия,
	|	Таблица.Событие КАК Событие,
	|	Таблица.ПредставлениеПриложения КАК ПредставлениеПриложения,
	|	Таблица.Дата КАК Дата
	|ПОМЕСТИТЬ втТаблицаОшибок
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаОшибок.ПредставлениеДанных КАК ПредставлениеДанных,
	|	втТаблицаОшибок.Комментарий КАК Комментарий,
	|	втТаблицаОшибок.Компьютер КАК Компьютер,
	|	втТаблицаОшибок.ИмяПользователя КАК ИмяПользователя,
	|	втТаблицаОшибок.Пользователь КАК Пользователь,
	|	втТаблицаОшибок.ПредставлениеСобытия КАК ПредставлениеСобытия,
	|	втТаблицаОшибок.Событие КАК Событие,
	|	втТаблицаОшибок.ПредставлениеПриложения КАК ПредставлениеПриложения,
	|	втТаблицаОшибок.Дата КАК Дата,
	|	ИСТИНА КАК ЗаписьНеИсправлена
	|ПОМЕСТИТЬ втИтог
	|ИЗ
	|	втТаблицаОшибок КАК втТаблицаОшибок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтог.ПредставлениеДанных КАК ПредставлениеДанных,
	|	втИтог.Комментарий КАК Комментарий,
	|	втИтог.Компьютер КАК Компьютер,
	|	втИтог.ИмяПользователя КАК ИмяПользователя,
	|	втИтог.Пользователь КАК Пользователь,
	|	втИтог.ПредставлениеСобытия КАК ПредставлениеСобытия,
	|	втИтог.Событие КАК Событие,
	|	втИтог.ПредставлениеПриложения КАК ПредставлениеПриложения,
	|	втИтог.Дата КАК Дата,
	|	втИтог.ЗаписьНеИсправлена КАК ЗаписьНеИсправлена
	|ИЗ
	|	втИтог КАК втИтог
	|ГДЕ
	|	втИтог.ЗаписьНеИсправлена";
	Запрос.УстановитьПараметр("Таблица", ПодложкаЖурнала);
	
	ТаблицаОшибокИтог = Запрос.Выполнить().Выгрузить();
	ТаблицаОшибокИтог.Колонки.Добавить("Данные");
	ТаблицаОшибокИтог.Колонки.Добавить("Метаданные");
	ТаблицаОшибокИтог.Колонки.Добавить("ПредставлениеМетаданных");
	Для Каждого Строка Из ТаблицаОшибокИтог Цикл
		УИД = Новый УникальныйИдентификатор(Строка.Пользователь);
		
		СтруктураПоиска = Новый Структура("Пользователь, Дата, Событие", УИД, Строка.Дата, Строка.Событие);
		НайденнаяСтрока = тзЖурнал.НайтиСтроки(СтруктураПоиска);
		
		ЗаполнитьЗначенияСвойств(Строка, НайденнаяСтрока[0]);
		Строка.Пользователь = НайденнаяСтрока[0].Пользователь;
	КонецЦикла;
	
	Возврат ТаблицаОшибокИтог;
	
КонецФункции

Функция ПарсингЖурналаРегистрации(ТаблицаЖурнала, Знач ИсправленныеОшибки = Неопределено) Экспорт
	
	СчетчикОшибок = 0;                                                                                 
	МассивОшибок = Новый Массив;
	СоответствиеПользователей = Новый Соответствие;        
	
	МассУдаляемыхСтрок = Новый Массив;
	Для Каждого Строка Из ТаблицаЖурнала Цикл
		
		Если СтрНайти(Строка.Комментарий, "Недостаточно прав для работы с таблицей") Тогда
			
			Если ИсправленныеОшибки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НачальнаяПозиция = СтрНайти(Строка.Комментарий, "Недостаточно прав для работы с таблицей") + 41;
			
			ПозицияТочки = СтрНайти(Строка.Комментарий, ".",, НачальнаяПозиция);
			ПозицияКонецСтроки = СтрНайти(Строка.Комментарий, """",, ПозицияТочки);
			
			ТипМетаданного = Сред(Строка.Комментарий, НачальнаяПозиция, ПозицияТочки - НачальнаяПозиция);
			ИмяМетаданного = Сред(Строка.Комментарий, ПозицияТочки + 1, ПозицияКонецСтроки - ПозицияТочки - 1);  
			
			// Ошибка? Иногда пользователь в ЖР = <Неопределено>
			Если НЕ ЗначениеЗаполнено(Строка.Пользователь) Тогда
				Продолжить;
			КонецЕсли;
		
			ТекПользователь = ПолучитьТекущегоПользователя(Строка.Пользователь);
			
			Отбор = Новый Структура;
			Отбор.Вставить("Пользователь", ТекПользователь);
			Отбор.Вставить("ТаблицаОшибки", ТипМетаданного + "." + ИмяМетаданного);
			
			Если ИсправленныеОшибки = Неопределено Тогда
				ОшибкаБылаИсправлена = Ложь;
			Иначе
				ОшибкаБылаИсправлена = ИсправленныеОшибки.НайтиСтроки(Отбор);
			КонецЕсли;
			
			Если ОшибкаБылаИсправлена.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМетаданных = СформироватьСткМетаданных(ТипМетаданного, ИмяМетаданного, Строка.Комментарий, Строка.Дата, Истина, Строка.Событие);
			
			ДанныеОшибок = Новый Массив;			
			ДанныеОшибок.Добавить(СтруктураМетаданных);
			
			КлючПользователя = СоответствиеПользователей.Получить(ТекПользователь);
			
			Если КлючПользователя = Неопределено Тогда				
				СоответствиеПользователей.Вставить(ТекПользователь, ДанныеОшибок);
				СчетчикОшибок = СчетчикОшибок + 1;
			ИначеЕсли НЕ ОбъектУжеИзвестен(СтруктураМетаданных, КлючПользователя) Тогда				
				КлючПользователя.Добавить(СтруктураМетаданных);
				СчетчикОшибок = СчетчикОшибок + 1;
			КонецЕсли; 
			
		ИначеЕсли СтрНайти(Строка.Комментарий, "У пользователя недостаточно прав") Тогда  
			
			Если ИсправленныеОшибки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМетаданных = СформироватьСткМетаданных("", "", Строка.Комментарий, Строка.Дата, Ложь, Строка.Событие);
			
			ДанныеОшибок = Новый Массив;			
			ДанныеОшибок.Добавить(СтруктураМетаданных);
			
			ТекПользователь = ПолучитьТекущегоПользователя(Строка.Пользователь);
			
			КлючПользователя = СоответствиеПользователей.Получить(ТекПользователь);
			
			Если КлючПользователя = Неопределено Тогда				
				СоответствиеПользователей.Вставить(ТекПользователь, ДанныеОшибок);
				СчетчикОшибок = СчетчикОшибок + 1;
			КонецЕсли;
			
		// Условие для УТ 11.4 (отличаются записи в ЖР от КА 2.5)
		ИначеЕсли СтрНайти(Строка.Комментарий, "Нарушение прав доступа!") Тогда       
			
			Если ИсправленныеОшибки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМетаданных = СформироватьСткМетаданных("", "", Строка.Комментарий, Строка.Дата, Ложь, Строка.Событие);
			
			ДанныеОшибок = Новый Массив;
			ДанныеОшибок.Добавить(СтруктураМетаданных);
			
			ТекПользователь = ПолучитьТекущегоПользователя(Строка.Пользователь);
			
			КлючПользователя = СоответствиеПользователей.Получить(ТекПользователь);
			
			Если КлючПользователя = Неопределено Тогда
				СоответствиеПользователей.Вставить(ТекПользователь, ДанныеОшибок);
				СчетчикОшибок = СчетчикОшибок + 1;
			КонецЕсли;
			
		// Строка с ошибкой зафиксирована в КА 2.5
		ИначеЕсли СтрНайти(Строка.Комментарий, "Недостаточно прав для просмотра") Тогда  
			
			Если ИсправленныеОшибки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМетаданных = СформироватьСткМетаданных("", "", Строка.Комментарий, Строка.Дата, Ложь, Строка.Событие);
			
			ДанныеОшибок = Новый Массив;
			ДанныеОшибок.Добавить(СтруктураМетаданных);
			
			ТекПользователь = ПолучитьТекущегоПользователя(Строка.Пользователь);
			
			КлючПользователя = СоответствиеПользователей.Получить(ТекПользователь);
			
			Если КлючПользователя = Неопределено Тогда
				СоответствиеПользователей.Вставить(ТекПользователь, ДанныеОшибок);
				СчетчикОшибок = СчетчикОшибок + 1;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ИсправленныеОшибки = Неопределено Тогда
			МассУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из МассУдаляемыхСтрок Цикл
		ТаблицаЖурнала.Удалить(Строка);
	КонецЦикла;
	
	Возврат Новый Структура("СоответствиеПользователей, СчетчикОшибок", СоответствиеПользователей, СчетчикОшибок);
	
КонецФункции

Процедура ИзменитьСоставГруппы(Знач ДополнительныеПараметры, ОписаниеОшибки = "") Экспорт
		
	Если НЕ РазрешеноИзменениеСоставаПользователейГруппы(ДополнительныеПараметры.ГруппаДоступа) Тогда
		Если ДополнительныеПараметры.ВключитьВГруппуДоступа Тогда
			ОписаниеОшибки =
				НСтр("ru = 'Недостаточно прав для включения пользователя в группу доступа,
				           |(не ответственный за участников группы доступа или нет прав администратора).'");
		Иначе
			ОписаниеОшибки =
				НСтр("ru = 'Недостаточно прав для исключения пользователя из группы доступа,
				           |(не ответственный за участников группы доступа или нет прав администратора).'");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметры.ВключитьВГруппуДоступа И НЕ ПользовательВключенВГруппуДоступа(ДополнительныеПараметры.ГруппаДоступа, ДополнительныеПараметры.Пользователь) Тогда
		ОписаниеОшибки =
			НСтр("ru = 'Невозможно исключить пользователя из группы доступа,
			           |так как он включен в нее косвенно.'");
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено()
	   И ДополнительныеПараметры.ГруппаДоступа = ГруппаДоступаАдминистраторы
	   И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПользователиВМоделиСервиса") Тогда
		
		МодульПользователиСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("ПользователиСлужебныйВМоделиСервиса");
		ДействияСПользователемСервиса = МодульПользователиСлужебныйВМоделиСервиса.ПолучитьДействияСПользователемСервиса();
		
		Если НЕ ДействияСПользователемСервиса.ИзменениеАдминистративногоДоступа Тогда
			ВызватьИсключение
				НСтр("ru = 'Недостаточно прав доступа для изменения состава администраторов.'");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ГруппыДоступа");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДополнительныеПараметры.ГруппаДоступа);
		Блокировка.Заблокировать();
		
		ГруппаДоступаОбъект = ДополнительныеПараметры.ГруппаДоступа.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(ГруппаДоступаОбъект.Ссылка, ГруппаДоступаОбъект.ВерсияДанных);
		Если ДополнительныеПараметры.ВключитьВГруппуДоступа Тогда
			Если ГруппаДоступаОбъект.Пользователи.Найти(ДополнительныеПараметры.Пользователь, "Пользователь") = Неопределено Тогда
				ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = ДополнительныеПараметры.Пользователь; 
			ИначеЕсли ДополнительныеПараметры.ВключитьВГруппуДоступа Тогда
				ОписаниеОшибки = НСтр("ru = 'Пользователь уже включен в группу.'");
			КонецЕсли;
		Иначе
			СтрокаТЧ = ГруппаДоступаОбъект.Пользователи.Найти(ДополнительныеПараметры.Пользователь, "Пользователь");
			Если СтрокаТЧ <> Неопределено Тогда
				ГруппаДоступаОбъект.Пользователи.Удалить(СтрокаТЧ);
			КонецЕсли;
		КонецЕсли;
		
		Если ГруппаДоступаОбъект.Ссылка = ГруппаДоступаАдминистраторы Тогда
			
			Если ОбщегоНазначения.РазделениеВключено() Тогда
				ГруппаДоступаОбъект.ДополнительныеСвойства.Вставить(
					"ПарольПользователяСервиса", ПарольПользователяСервиса);
			Иначе
				УправлениеДоступомСлужебный.ПроверитьНаличиеПользователяИБВГруппеДоступаАдминистраторы(
					ГруппаДоступаОбъект.Пользователи, ОписаниеОшибки);
				
				Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
					ОтменитьТранзакцию();
					РазблокироватьДанныеДляРедактирования(ГруппаДоступаОбъект.Ссылка);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ГруппаДоступаОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		РазблокироватьДанныеДляРедактирования(ГруппаДоступаОбъект.Ссылка);
		ПарольПользователяСервиса = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
	РазблокироватьДанныеДляРедактирования(ГруппаДоступаОбъект.Ссылка);
	УправлениеДоступомСлужебный.ЗапуститьОбновлениеДоступа();
	
КонецПроцедуры  

&НаСервере
Функция СформироватьСткМетаданных(ТипМетаданного, ИмяМетаданного, Комментарий, ДатаОшибки, МожноИсправить, Событие)
	
	СтруктураМетаданных = Новый Структура;
	СтруктураМетаданных.Вставить("ТипМетаданного", ТипМетаданного);	
	СтруктураМетаданных.Вставить("ИмяМетаданного", ИмяМетаданного);
	СтруктураМетаданных.Вставить("Комментарий",    Комментарий);
	СтруктураМетаданных.Вставить("МожноИсправить", Ложь);
	СтруктураМетаданных.Вставить("ДатаОшибки",     ДатаОшибки);
	СтруктураМетаданных.Вставить("Событие",        Событие);
	
	Возврат СтруктураМетаданных;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТипыОшибок() 
	
	ЗначениеКонстанты = Неопределено;
	
	Попытка
		ЗначениеКонстанты = Константы.УД_ТипОшибокДляУведомленийОбОшибках_tg.Получить();
	Исключение
		ЗначениеКонстанты = Неопределено;
	КонецПопытки;
	
	Если ЗначениеКонстанты = Неопределено Тогда
		ПометкиТаблицыУровней = Новый Структура("Первая, Вторая", Ложь, Ложь);
	Иначе
		ПометкиТаблицыУровней = Новый Структура("Первая, Вторая");
		
		РазделеннаяСтрока = СтрРазделить(ЗначениеКонстанты, ";");
		
		ПометкиТаблицыУровней.Первая = ?(РазделеннаяСтрока.Количество() > 0 И РазделеннаяСтрока[0] = "Истина", Истина, Ложь);
		ПометкиТаблицыУровней.Вторая = ?(РазделеннаяСтрока.Количество() > 1 И РазделеннаяСтрока[1] = "Истина", Истина, Ложь);
	КонецЕсли;
	
	Возврат ПометкиТаблицыУровней;
	
КонецФункции

Функция СоздатьПодложкуДляЖурнала(Колонки)
	
	масКолонок = СтрРазделить(Колонки, ",");
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из масКолонок Цикл
		
		Если Колонка = "Данные" Или Колонка = "Метаданные" Или Колонка = "ПредставлениеМетаданных" Тогда
			Продолжить;
		КонецЕслИ;
		
		Если Колонка = "Дата" Тогда
			ТипКолонки = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
		Иначе
			ТипКолонки = ОбщегоНазначения.ОписаниеТипаСтрока(500);
		КонецЕсли;
		
		Таблица.Колонки.Добавить(Колонка, ТипКолонки);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТекущегоПользователя(ПользовательСтроки) Экспорт
	
	ИмяПользователяСтрокой = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ПользовательСтроки)).ПолноеИмя;
	Возврат Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяСтрокой);
	
КонецФункции

Функция ОбъектУжеИзвестен(СтруктураМетаданных, КлючПользователя)
	
	ОбъектУжеЕсть = Ложь;
	
	Для Каждого Мета Из КлючПользователя Цикл		
		Если Мета.ТипМетаданного = СтруктураМетаданных.ТипМетаданного И Мета.ИмяМетаданного = СтруктураМетаданных.ИмяМетаданного Тогда			
			ОбъектУжеЕсть = Истина;
			Прервать;			
		КонецЕсли;		
	КонецЦикла;		
	
	Возврат ОбъектУжеЕсть;
	
КонецФункции

Функция ПользовательВключенВГруппуДоступа(ГруппаДоступа, Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступа);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|ГДЕ
	|	ГруппыДоступаПользователи.Ссылка = &ГруппаДоступа
	|	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция РазрешеноИзменениеСоставаПользователейГруппы(ГруппаДоступа)
	
	Если ПользовательИБПолноправный Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступа",              ГруппаДоступа);
	Запрос.УстановитьПараметр("АвторизованныйПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО (СоставыГруппПользователей.Пользователь = &АвторизованныйПользователь)
	|			И (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступа.Ответственный)
	|			И (ГруппыДоступа.Ссылка = &ГруппаДоступа)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

Функция СведенияОВнешнейОбработке() Экспорт

    ИмяОтчета = ЭтотОбъект.Метаданные().Имя;
    Синоним = ЭтотОбъект.Метаданные().Синоним;
    Синоним = ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОтчета);

    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
    РегистрационныеДанные.Вставить("Наименование", Синоним);
    РегистрационныеДанные.Вставить("Версия", "4.5");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Информация", "Анализ и контроль доступа");

    ТаблицаКоманд = ПолучитьТаблицуКоманд();

    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	 
	// Ручной запуск
	ДобавитьКоманду(ТаблицаКоманд, "Открыть обработку", "ОткрытьОбработку", ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(), Истина);

    Возврат РегистрационныеДанные;
	
КонецФункции     

Функция ПолучитьТаблицуКоманд()

    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

    Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")

    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры 

// Telegram: @QIQTPP
// Email: denqiqtp@gmail.com
// Github: https://github.com/VorozhbitDM/Access-control-1C
