
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресСоответствияПользователей) Тогда		
		Ошибки = ПолучитьИзВременногоХранилища(Параметры.АдресСоответствияПользователей);		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресТаблицыОшибок) Тогда
		ТаблицаОшибокИзВХ = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыОшибок);
		
		УдалитьИзВременногоХранилища(Параметры.АдресТаблицыОшибок);
	КонецЕсли;
	
	Если ТекущаяДата() >= Дата('2035.07.15 00:00:01') ИЛИ ТекущаяДатаСеанса() >= Дата('2035.07.15 00:00:01') Тогда	
		Сообщить(НСтр("ru = 'Закончился срок действия пробного периода. Если вы заинтересованы в дальнейшем использовании продукта, 
		|обратитесь по адресу эл. почты ""denqiqtp@gmail.com"".
		|https://github.com/VorozhbitDM/Access-control-1C'"));
		
		Для Каждого Эл Из Элементы Цикл
			
			Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
				Эл.ТолькоПросмотр = Истина;
			ИначеЕсли ТипЗнч(Эл) = Тип("КнопкаФормы") Тогда
				Эл.Доступность = Ложь;
			КонецЕсли;
			
		КонецЦикла; 	
		Отказ = Истина; 
		Возврат;	
	КонецЕсли;
	
	Для Каждого Строка Из Ошибки Цикл
		
		Пользователь = Строка.Ключ;
		
		Для Каждого Значение Из Строка.Значение Цикл
			
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Пользователь  = Строка.Ключ;
			НоваяСтрока.ТаблицаОшибки = ?(НЕ ПустаяСтрока(Значение.ТипМетаданного), Значение.ТипМетаданного + "." + Значение.ИмяМетаданного, "");
			НоваяСтрока.ДатаОшибки 	  = Значение.ДатаОшибки;
			НоваяСтрока.Комментарий	  = Значение.Комментарий;
			НоваяСтрока.Ошибка		  = ?(НЕ ПустаяСтрока(НоваяСтрока.ТаблицаОшибки), Истина, Ложь);
			НоваяСтрока.Событие       = Значение.Событие;
			
			Если НЕ ТаблицаОшибокИзВХ = Неопределено Тогда
				ПараметрыОтбора = Новый Структура("Пользователь, ТаблицаОшибки, ДатаОшибки");
				ЗаполнитьЗначенияСвойств(ПараметрыОтбора, НоваяСтрока);
				НайденнаяСтрока = ТаблицаОшибокИзВХ.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденнаяСтрока.Количество() > 0 Тогда
					НоваяСтрока.СкрытьОшибку = НайденнаяСтрока[0].СкрытьОшибку;
					НоваяСтрока.Ошибка = ?(НоваяСтрока.СкрытьОшибку, Ложь, НоваяСтрока.Ошибка);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НоваяСтрока.Ошибка Тогда
				НайденныйПользователь = ВыбранныеПользователи.НайтиПоЗначению(Строка.Ключ);
				Если НайденныйПользователь = Неопределено Тогда
					ВыбранныеПользователи.Добавить(Строка.Ключ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаОшибок.Сортировать("Ошибка УБЫВ, ДатаОшибки УБЫВ");
	
	ЭтотОбъект.Заголовок = "Сканирование ошибок на " + Формат(Параметры.ДатаОшибок, "ДЛФ=DD");
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ЗакрытьФорму(Новый Структура("ОбработатьИсправление"), Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыделитьСнятьВсе(Команда)
	
	Для Каждого Строка Из ТаблицаОшибок Цикл		
		Строка.Ошибка = ?(Команда.Имя = "ВыделитьВсе" И Строка.ПредложеннаяГруппа <> "Нет предложений", Истина, Ложь);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	
	Если ТаблицаОшибок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Отсутсвуют ошибка для исправления.'"));
	КонецЕсли;
	
	ПараметрыОтбора  = Новый Структура("Ошибка, ПредложеннаяГруппа", Истина, "Нет предложений");
	СтрокиНаОтправку = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора);
	
	Если СтрокиНаОтправку.Количество() > 0 Тогда
		ОО = Новый ОписаниеОповещения("ПослеВопросаПередЗакрытием", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Были отмечены строки, которые невозможно исправить автоматически, исключить такие строки и продолжить автоисправление?'"); 
		ПоказатьВопрос(ОО, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
		Возврат;
	КонецЕсли;
	
	ПослеВопросаПередЗакрытием(КодВозвратаДиалога.Да, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователя(Команда)
	
	ПеренестиНаКлиенте();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВОбработку(Команда)

	Ответ = ПроверитьВыборПользователей();
	
	НесколькоПользователей = Ложь;
	Если Ответ.ЕстьОшибки Тогда
		Для Каждого Ошибка Из Ответ.Ошибки Цикл
			Если Ошибка = НСтр("ru='Было выбрано несколько пользователей, для переноса в обработку доступен только выбор одного пользователя.'") Тогда
				НесколькоПользователей = Истина;
			КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);	
		КонецЦикла;
	КонецЕсли;
	
	Если НесколькоПользователей Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПользователя", ЭтотОбъект);
		ВыбранныеПользователи.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru='Выберите пользователя который будет перенесён в обработку.'"));
		
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Пользователь", Элементы.ТаблицаОшибок.ТекущиеДанные.Пользователь);
	ДополнительныеПараметры.Вставить("Таблица", Элементы.ТаблицаОшибок.ТекущиеДанные.ТаблицаОшибки);
	
	ЗакрытьФорму(ДополнительныеПараметры);	
	
КонецПроцедуры 

&НаКлиенте
Процедура СкрытьТекущуюОшибку(Команда)
	
	ТекДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные.СкрытьОшибку = Истина;
	ТекДанные.Ошибка = Ложь;
	
	НайденноеЗначение = ВыбранныеПользователи.НайтиПоЗначению(ТекДанные.Пользователь);
	Если НЕ НайденноеЗначение = Неопределено Тогда
		ПараметрыОтбора = Новый Структура("Пользователь", ТекДанные.Пользователь);
		НайденнаяСтрока = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденнаяСтрока.Количество() = 0 Тогда
			ВыбранныеПользователи.Удалить(ВыбранныеПользователи.НайтиПоЗначению(ТекДанные.Пользователь));	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокСкрытыхОшибок(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл
		
		СтрокаТаблицы.СкрытьОшибку = Ложь;
		СтрокаТаблицы.Ошибка       = ?(НЕ ПустаяСтрока(СтрокаТаблицы.ТаблицаОшибки), Истина, Ложь);
		
	КонецЦикла;

	ТаблицаОшибок.Сортировать("Ошибка УБЫВ, ДатаОшибки УБЫВ");

КонецПроцедуры

&НаКлиенте
Процедура ОшибкаИсправлена(Команда)
	
	ВыделенныеСтроки = ВыбранныеСтроки();
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='У выделенных в списке строк будет установлен статус ""Исправлено"". Продолжить?'");
	
	ДополнительныеПараметры = Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПризнакУстановлено", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииСтроки(Элемент)

	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Или ВыбраннаяСтрокаТаблицыОшибок = (Строка(ТекДанные.Пользователь) + ТекДанные.ТаблицаОшибки + Строка(ТекДанные.ДатаОшибки)) Тогда
		Возврат;
	КонецЕсли;                                                              
	
	ВыбраннаяСтрокаТаблицыОшибок = Строка(ТекДанные.Пользователь) + ТекДанные.ТаблицаОшибки + Строка(ТекДанные.ДатаОшибки);
	
	Комментарий = Элемент.ТекущиеДанные.Комментарий;
	Элементы.ВыбратьПользователя.Видимость = НЕ ПустаяСтрока(ТекДанные.ТаблицаОшибки); 
	Элементы.ТаблицаОшибокКонтекстноеМенюВыбратьПользователяИТаблицу.Видимость = ПустаяСтрока(ТекДанные.ТаблицаОшибки); 
			
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные.ПредложеннаяГруппа = "Нет предложений" Тогда
		Элемент.ТекущиеДанные.Ошибка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокОшибкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Ошибка Тогда
		НайденныйПользователь = ВыбранныеПользователи.НайтиПоЗначению(ТекДанные.Пользователь);
		Если НайденныйПользователь = Неопределено Тогда
			ВыбранныеПользователи.Добавить(ТекДанные.Пользователь);
		КонецЕсли;                                                 
	Иначе                 
		ПараметрыОтбора = Новый Структура("Ошибка, Пользователь", Истина, ТекДанные.Пользователь);
		НайденныеСтроки = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ВыбранныеПользователи.Удалить(ВыбранныеПользователи.НайтиПоЗначению(ТекДанные.Пользователь));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораПользователя(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Закрыть(ДополнительныеПараметры);
	ИначеЕсли НЕ Ответ = Неопределено И ТипЗнч(Ответ.Значение) = Тип("СправочникСсылка.Пользователи") Тогда                            
		
		ПараметрыОтбора = Новый Структура("Ошибка", Истина);
		НайденныеСтроки = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.Ошибка = Ответ.Значение = Строка.Пользователь;
		КонецЦикла;  
		
		ВыбранныеПользователи.Удалить(Ответ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНаКлиенте()

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Пользователь", Элементы.ТаблицаОшибок.ТекущиеДанные.Пользователь);
	ДопПараметры.Вставить("Таблица", Элементы.ТаблицаОшибок.ТекущиеДанные.ТаблицаОшибки);
	
	ОО = Новый ОписаниеОповещения("ПослеВыбораПользователя", ЭтотОбъект, ДопПараметры);
	Если ДопПараметры.Таблица = "" Тогда
		ПоказатьВопрос(ОО, "Перенести пользователя в форму анализа ролей?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Выбор пользователя");
	Иначе
		ПоказатьВопрос(ОО, "Перенести пользователя и таблицу ошибки в форму анализа ролей?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Выбор пользователя и таблицы");			
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СкрытьОшибку", Ложь);
	
	Элементы.ТаблицаОшибок.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ДополнительныеПараметры, ЗакрыватьФорму = Истина)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("АдресТаблицыОшибок", ПолучитьАдресТаблицыОшибок(ТаблицаОшибок));
	
	Для Каждого СтрокаСвойств Из ДополнительныеПараметры Цикл
		ПараметрыЗакрытия.Вставить(СтрокаСвойств.Ключ, СтрокаСвойств.Значение);
	КонецЦикла;
	
	Если ДополнительныеПараметры.Свойство("Пользователь") Тогда
		Событие = "НеобходимоПеренестиВОбработку";
	ИначеЕсли ДополнительныеПараметры.Свойство("СтрокиДляОбработки") Тогда 
		Событие = "НеобходимоВыполнитьАвтоматическоеИсправление";
	ИначеЕсли ДополнительныеПараметры.Свойство("ОбработатьИсправление") Тогда
		Событие = "ОбработкаИсправленияОшибок";
	КонецЕсли;
	
	Оповестить(Событие, ПараметрыЗакрытия, ЭтаФорма);
	
	Если ЗакрыватьФорму Тогда
		Закрыть(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресТаблицыОшибок(Знач ТаблицаОшибок)
	
	КопияТаблицыОшибок = ДанныеФормыВЗначение(ТаблицаОшибок, Тип("ТаблицаЗначений"));
	Возврат ПоместитьВоВременноеХранилище(КопияТаблицыОшибок, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПроверитьВыборПользователей()

	ЕстьОшибки = Ложь;
	Ошибки	   = Новый Массив;

	Если ТаблицаОшибок.Количество() = 0 Тогда
		ЕстьОшибки = Истина;  
		Ошибки.Добавить(НСтр("ru='Не выбрано ни одной строки.'"));
	КонецЕсли;
	
	Если ВыбранныеПользователи.Количество() > 1 Тогда
		ЕстьОшибки = Истина;
		Ошибки.Добавить(НСтр("ru='Было выбрано несколько пользователей, для переноса в обработку доступен только выбор одного пользователя.'"));
	КонецЕсли;
	
	Возврат Новый Структура("ЕстьОшибки, Ошибки", ЕстьОшибки, Ошибки);
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаПередЗакрытием(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыОтбора  = Новый Структура("Ошибка", Истина);
		СтрокиНаОтправку = ТаблицаОшибок.НайтиСтроки(ПараметрыОтбора); 
		
		Если НЕ СтрокиНаОтправку.Количество() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите строки, которые необходимо исправить.'"));		
			Возврат;
		КонецЕсли;	
		
		ЗакрытьФорму(Новый Структура("СтрокиДляОбработки", СтрокиНаОтправку));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеСтроки()
	
	Возврат ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.ТаблицаОшибок);
	
КонецФункции

&НаКлиенте
Процедура УстановитьПризнакУстановлено(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ТекСтрока = ТаблицаОшибок.НайтиПоИдентификатору(Строка);
		
		ТекСтрока.ОшибкаИсправлена = Истина;
		ТекСтрока.КартинкаИсправления = БиблиотекаКартинок.ОформлениеФлажок;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
