
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.АдресURL) тогда 
		АдресURL = Параметры.АдресURL;
		HTML = АдресURL;
	Иначе
		HTML = Параметры.HTML;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	
	Попытка
		АдресURL = Элемент.Документ.url;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВБраузере(Команда)
	
	Попытка
		ЗапуститьПриложение(АдресURL);
	Исключение  
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
