#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыАдминистрирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТекущаяДата() >= Дата('2035.07.15 00:00:01') ИЛИ ТекущаяДатаСеанса() >= Дата('2035.07.15 00:00:01') Тогда	
		Сообщить(НСтр("ru = 'Закончился срок действия пробного периода. Если вы заинтересованы в дальнейшем использовании продукта, 
		|обратитесь по адресу эл. почты ""denqiqtp@gmail.com"".
		|https://github.com/VorozhbitDM/Access-control-1C'"));
		
		Для Каждого Эл Из Элементы Цикл
			
			Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
				Эл.ТолькоПросмотр = Истина;
			ИначеЕсли ТипЗнч(Эл) = Тип("КнопкаФормы") Тогда
				Эл.Доступность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Мониторинг", Мониторинг);
	
	НомерСеансаИнформационнойБазы = НомерСеансаИнформационнойБазы(); 
	
	ЗапрашиватьПараметрыАдминистрированияИБ = Истина;
	
	ПолучитьСтатусПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ПолучитьСтатусПользователя();	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	
	Если Сеанс = НомерСеансаИнформационнойБазы Тогда
		ПоказатьПредупреждение( ,НСтр("ru = 'Невозможно завершить текущий сеанс. Для выхода из программы можно закрыть главное окно программы.'"));
		Возврат;
	КонецЕсли; 
	
	Если Статус = "Не в сети" Тогда
		ПоказатьПредупреждение( ,НСтр("ru = 'У пользователя нет запущенного сеанса.'"));
		Возврат;
	КонецЕсли; 		
	
	НомераСеансов = Новый Массив;
	НомераСеансов.Добавить(Сеанс);
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыРаботыКлиента.РазделениеВключено И ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		
		СтандартнаяОбработка = Истина;
		ОповещениеПослеЗавершенияСеансов = Новый ОписаниеОповещения(
			"ПослеЗавершенияСеанса", ЭтотОбъект, Новый Структура("НомераСеансов", НомераСеансов));
		ИнтеграцияПодсистемБСПКлиент.ПриЗавершенииСеансов(ЭтотОбъект, НомераСеансов, СтандартнаяОбработка, ОповещениеПослеЗавершенияСеансов);
		
	Иначе
		Если ЗапрашиватьПараметрыАдминистрированияИБ Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьСеансПродолжение", ЭтотОбъект, НомераСеансов);
			ЗаголовокФормы = НСтр("ru = 'Завершение сеанса'");
			ПоясняющаяНадпись = НСтр("ru = 'Для завершения сеанса введите параметры
				|администрирования кластера серверов'");
			СоединенияИБКлиент.ПоказатьПараметрыАдминистрирования(ОписаниеОповещения, Ложь, Истина, ПараметрыАдминистрирования, ЗаголовокФормы, ПоясняющаяНадпись);
		Иначе
			ЗавершитьСеансПродолжение(ПараметрыАдминистрирования, НомераСеансов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьСписокСеансов(Команда)
	
	ОткрытьФорму("Обработка.АктивныеПользователи.Форма.АктивныеПользователи");
	
КонецПроцедуры               

&НаКлиенте
Процедура ОткрытьЗакрытьПериод(Команда)
	
	ПараметрыОткрытия = Новый Структура("Пользователь", Мониторинг);
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ДатыЗапретаИзменения", ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖР(Команда)
	
	ПараметрыОткрытия = Новый Структура("Пользователь", Строка(Мониторинг));
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МониторингПриИзменении(Элемент)
	
	НачалоСеанса 				  = Неопределено;
	ИмяКомпьютера 				  = Неопределено;
	ИмяПриложения 				  = Неопределено;
	IPАдресКлиента				  = Неопределено;
	ДатаПоследнейАктивности		  = Неопределено;
	ПользовательОС 				  = Неопределено;
	ДатаРазрешенияВходаВПрограмму = Неопределено;
	Почта 						  = Неопределено;
		
	ПолучитьСтатусПользователя();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПользовательОнлайн(Пользователь) 
	
	СеансНайден = Ложь;
	
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	НомерСоединения 		 = НомерСоединенияИнформационнойБазы();
	УИДПользователяИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ).УникальныйИдентификатор;
	
	Для Каждого ТекСеанс Из СеансыИнформационнойБазы Цикл
		
		//Если ТекСеанс.НомерСоединения = НомерСоединения И (ТекСеанс.ИмяПриложения = "1CV8C" ИЛИ ТекСеанс.ИмяПриложения = "WebClient" ИЛИ ТекСеанс.ИмяПриложения = "SrvrConsole") Тогда
		Если ТекСеанс.Пользователь.УникальныйИдентификатор = УИДПользователяИБ И (ТекСеанс.ИмяПриложения = "1CV8C" ИЛИ ТекСеанс.ИмяПриложения = "WebClient" ИЛИ ТекСеанс.ИмяПриложения = "SrvrConsole") Тогда
			СеансНайден = Истина;    
			СтрокаСвойств = "IPАдресКлиента, ИмяКомпьютера, ИмяПриложения, НачалоСеанса";
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекСеанс, СтрокаСвойств);
			
			Сеанс = ТекСеанс.НомерСеанса;
			
			Если ИмяПриложения = "1CV8C" Тогда
				ИмяПриложения = "Тонкий клиент";
			ИначеЕсли ИмяПриложения = "WebClient" Тогда
				ИмяПриложения = "Веб клиент";     
			ИначеЕсли ИмяПриложения = "SrvrConsole" Тогда
				ИмяПриложения = "Консоль кластера серверов";
			КонецЕсли;
			
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;	
	
	Возврат СеансНайден;
	
КонецФункции

&НаСервере
Процедура ПолучитьСтатусПользователя()
	
	Если НЕ ЗначениеЗаполнено(Мониторинг) Тогда Возврат; КонецЕсли;
	
	Если ПользовательОнлайн(Мониторинг) Тогда  
		Элементы.ЗавершитьСеанс.Доступность = Истина;
		Элементы.ДекорацияСтатус.Картинка   = БиблиотекаКартинок.ОформлениеКругЗеленый;
		Статус 								= "Онлайн";                                                
	Иначе                                                         
		Элементы.ЗавершитьСеанс.Доступность = Ложь;
		Элементы.ДекорацияСтатус.Картинка   = БиблиотекаКартинок.ОформлениеКругКрасный;
		Статус 								= "Не в сети";
	КонецЕсли;                                  
	
	Если Мониторинг = ПараметрыСеанса.АвторизованныйПользователь Тогда
		Элементы.ЗавершитьСеанс.Доступность = Ложь;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Мониторинг.ИдентификаторПользователяИБ);	
	ПользовательОС = ПользовательИБ.ПользовательОС;
	Почта = ПользовательИБ.АдресЭлектроннойПочты;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Недействителен КАК Недействителен,
	|	СведенияОПользователях.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
	|	СведенияОПользователях.ДатаРазрешенияВходаВПрограмму КАК ДатаРазрешенияВходаВПрограмму
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
	|		ПО (СведенияОПользователях.Пользователь = Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО Пользователи.Ссылка = ПользователиКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Мониторинг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаСвойств = "ДатаПоследнейАктивности, ДатаРазрешенияВходаВПрограмму"; 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, СтрокаСвойств);
	КонецЕсли;
	
	ВходВПрограммуРазрешен = Пользователи.ВходВПрограммуРазрешен(Пользователи.СвойстваПользователяИБ(ПользовательИБ.УникальныйИдентификатор));
	
	Элементы.ДекорацияРазрешен.Видимость = ?(ВходВПрограммуРазрешен, Истина, Ложь);
	Элементы.ДекорацияЗапрещен.Видимость = ?(ВходВПрограммуРазрешен, Ложь, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьСеансПродолжение(Результат, МассивСеансов) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыАдминистрирования = Результат;
	
	СтруктураСеанса = Новый Структура;
	СтруктураСеанса.Вставить("Свойство", 	 "Номер");
	СтруктураСеанса.Вставить("ВидСравнения", ВидСравнения.ВСписке);
	СтруктураСеанса.Вставить("Значение",	 МассивСеансов);
	
	Фильтр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураСеанса);
	
	Попытка
		УдалитьСеансыИнформационнойБазыНаСервере(ПараметрыАдминистрирования, Фильтр)
	Исключение
		ЗапрашиватьПараметрыАдминистрированияИБ = Истина;
		ВызватьИсключение;
	КонецПопытки;
	
	ЗапрашиватьПараметрыАдминистрированияИБ = Ложь;
	
	ПослеЗавершенияСеанса(КодВозвратаДиалога.ОК, Новый Структура("НомераСеансов", МассивСеансов));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияСеанса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		Если ДополнительныеПараметры.НомераСеансов.Количество() > 1 Тогда
			
			ТекстОповещения = НСтр("ru = 'Сеансы %1 завершены.'");
			НомераСеансов   = СтрСоединить(ДополнительныеПараметры.НомераСеансов, ",");
			ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОповещения, НомераСеансов);
			ПоказатьОповещениеПользователя(НСтр("ru = 'Завершение сеансов'"),, ТекстОповещения);
			
		Иначе
			
			ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сеанс %1 завершен.'"), ДополнительныеПараметры.НомераСеансов[0]);
			ПоказатьОповещениеПользователя(НСтр("ru = 'Завершение сеанса'"),, ТекстОповещения);
			
		КонецЕсли;
		
		ПолучитьСтатусПользователя();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСеансыИнформационнойБазыНаСервере(ПараметрыАдминистрирования, Фильтр)
	
	АдминистрированиеКластера.УдалитьСеансыИнформационнойБазы(ПараметрыАдминистрирования,, Фильтр);
	
КонецПроцедуры

#КонецОбласти




