#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.СписокОбъектов) Тогда
		ЭтотОбъект.СписокОбъектов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.СписокОбъектов));
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = Параметры.ОбъектСвязи + " связан с объектами:";
	
	Элементы.ГруппаПроверка.Видимость = Ложь;
	
	Если ТекущаяДата() >= Дата('2035.07.15 00:00:01') ИЛИ ТекущаяДатаСеанса() >= Дата('2035.07.15 00:00:01') Тогда
		Сообщить(НСтр("ru = 'Закончился срок действия пробного периода. Если вы заинтересованы в дальнейшем использовании продукта, 
		|обратитесь по адресу эл. почты ""denqiqtp@gmail.com"".
		|https://github.com/VorozhbitDM/Access-control-1C'"));
		
		Для Каждого Эл Из Элементы Цикл
			
			Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
				Эл.ТолькоПросмотр = Истина;
			ИначеЕсли ТипЗнч(Эл) = Тип("КнопкаФормы") Тогда
				Эл.Доступность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОбъекта Из СписокОбъектов Цикл
		
		Точка = СтрНайти(СтрокаОбъекта.Объект, ".") + 1;
		ОбъектИмя = Сред(СтрокаОбъекта.Объект, Точка);   
		
		ТипМетаданного = ПолучитьИмяМетаданного(Лев(СтрокаОбъекта.Объект, Точка - 1));
		
		Если ТипМетаданного <> Неопределено Тогда
			СтрокаОбъекта.Объект = ТипМетаданного + ОбъектИмя;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда 
		Пользователь = Параметры.Пользователь;
		ПроверкаПрава = Элементы.ПроверкаПрава.СписокВыбора[1].Значение;
		ПроверитьРолиПользователя();
		Элементы.ГруппаПроверка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроверкаПраваПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "▼ ОСНОВНЫЕ ▼"     
		ИЛИ Элемент.ТекстРедактирования = "▼ ИНТЕРАКТИВНЫЕ ▼" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьРолиПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьВОбработке(Команда)
	
	ТекДанные = Элементы.СписокОбъектов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ПоказатьОбъектВДереве", Новый Структура("ТекОбъект", ТекДанные.Объект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьРолиПользователя()
	
	МассивВсехРолей = Новый Массив;
	
	Для Каждого МетаРоль Из Метаданные.Роли Цикл
		МассивВсехРолей.Добавить(МетаРоль);
	КонецЦикла;
	
	Для Каждого СтрокаОбъекта Из СписокОбъектов Цикл
		
		МассивРолейНаПроверку = Новый Массив;
		
		Для Каждого МетаРоль Из МассивВсехРолей Цикл
			
			Точка = СтрНайти(СтрокаОбъекта.Объект, ".") + 1;
			ОбъектИмя = Сред(СтрокаОбъекта.Объект, Точка);   
			
			ТипМетаданного = ПолучитьИмяМетаданного(Лев(СтрокаОбъекта.Объект, Точка - 1));
			
			Если ТипМетаданного = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			ОбъектМета = Метаданные.НайтиПоПолномуИмени(ТипМетаданного + ОбъектИмя); 
			
			Если ОбъектМета = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ПравоДоступа(ПроверкаПрава, ОбъектМета, МетаРоль) Тогда
				МассивРолейНаПроверку.Добавить(МетаРоль);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивРолейНаПроверку.Количество() Тогда
			
			Для Каждого СтрокаРоли Из МассивРолейНаПроверку Цикл
				
				СтрокаОбъекта.ПризнакНаличияРоли = ЕстьРоль(СтрокаРоли.Имя, Пользователь);
				
				Если СтрокаОбъекта.ПризнакНаличияРоли = Ложь Тогда
					СтрокаОбъекта.ПризнакНаличияРоли = ЕстьРольПользователя(СтрокаРоли.Имя, Пользователь);
				КонецЕсли; 
				
				Если СтрокаОбъекта.ПризнакНаличияРоли Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьИмяМетаданного(ТипМетаданного)
	
	Если ТипМетаданного = "Справочники." ИЛИ ТипМетаданного = "Справочник." Тогда
		Возврат "Справочник.";
	
	ИначеЕсли ТипМетаданного = "Документы." ИЛИ ТипМетаданного = "Документ." Тогда
		Возврат "Документ.";
	
	ИначеЕсли ТипМетаданного = "БизнесПроцессы." ИЛИ ТипМетаданного = "БизнесПроцесс." Тогда
		Возврат "БизнесПроцесс.";
	
	ИначеЕсли ТипМетаданного = "ПланыВидовХарактеристик." ИЛИ ТипМетаданного = "ПланВидовХарактеристик." Тогда
		Возврат "ПланВидовХарактеристик.";
	
	ИначеЕсли ТипМетаданного = "ПланыСчетов." ИЛИ ТипМетаданного = "ПланСчетов." Тогда
		Возврат "ПланСчетов.";
	
	ИначеЕсли ТипМетаданного = "ПланыВидовРасчета." ИЛИ ТипМетаданного = "ПланВидовРасчета." Тогда
		Возврат "ПланВидовРасчета.";
	
	ИначеЕсли ТипМетаданного = "Задачи." ИЛИ ТипМетаданного = "Задача." Тогда
		Возврат "Задача.";
	
	ИначеЕсли ТипМетаданного = "ПланыОбмена." ИЛИ ТипМетаданного = "ПланОбмена." Тогда
		Возврат "ПланОбмена.";
	
	ИначеЕсли ТипМетаданного = "Перечисления." ИЛИ ТипМетаданного = "Перечисление." Тогда
		Возврат "Перечисление.";
	
	Иначе
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции
        
&НаСервере
Функция ЕстьРоль(ИмяРоли, Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	1 КАК Поле1,
	               |	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	               |	ГруппыДоступаПользователи.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	               |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	               |ГДЕ
	               |	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	               |	И ГруппыДоступаПользователи.Пользователь В
	               |			(ВЫБРАТЬ
	               |				ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
	               |			ИЗ
	               |				Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |			ГДЕ
	               |				ГруппыПользователейСостав.Пользователь = &Пользователь)";
	
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Роль", ИмяРоли);
    
    УстановитьПривилегированныйРежим(Истина);
    РезультатЗапроса = Запрос.Выполнить();
    УстановитьПривилегированныйРежим(Ложь);
    
    Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
    
КонецФункции

&НаСервере
Функция ЕстьРольПользователя(ИмяРоли, Пользователь)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	1 КАК Поле1
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	               |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	               |ГДЕ
	               |	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	               |	И ГруппыДоступаПользователи.Пользователь = &Пользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	               |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |		ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Пользователь
	               |ГДЕ
	               |	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	               |	И ГруппыПользователейСостав.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции 

#КонецОбласти





