  
#Область ОбработчикиСобытий   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТекущаяДата() >= Дата('2035.07.15 00:00:01') ИЛИ ТекущаяДатаСеанса() >= Дата('2035.07.15 00:00:01') Тогда
		Сообщить(НСтр("ru = 'Закончился срок действия пробного периода. Если вы заинтересованы в дальнейшем использовании продукта, 
		|обратитесь по адресу эл. почты ""denqiqtp@gmail.com"".
		|https://github.com/VorozhbitDM/Access-control-1C'"));
		
		Для Каждого Эл Из Элементы Цикл
			
			Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда
				Эл.ТолькоПросмотр = Истина;
			ИначеЕсли ТипЗнч(Эл) = Тип("КнопкаФормы") Тогда
				Эл.Доступность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	УпрощенныйРежим = Истина;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = ?(Параметры.Пользователь = Справочники.Пользователи.ПустаяСсылка(), ПараметрыСеанса.АвторизованныйПользователь, Параметры.Пользователь);
	КонецЕсли;
	
	Если Параметры.Свойство("УпрощенныйРежим") И ЗначениеЗаполнено(Параметры.ТекстЗапроса) Тогда
		УпрощенныйРежим = Параметры.УпрощенныйРежим; 
		ТекстЗапроса = Параметры.ТекстЗапроса;
	КонецЕсли;
	
	ДобавитьСпискиПрав();
	
	ЗаполнитьСпискиПрав();
	
	СоздатьТаблицыЗначений();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УпрощенныйРежимПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура СписокПравПриПриИзмененииНаСервере(ИмяСпискаПрав)
	ОбновитьКолонкиТаблицы(ИмяСпискаПрав);
КонецПроцедуры

&НаКлиенте
Процедура СписокПравПриИзменении(Элемент)
	СписокПравПриПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

#КонецОбласти     

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	
	Если ТекстЗапроса = "" Тогда
		Возврат;
	КонецЕсли;   
	
	ВыполнитьАнализНаСервере(ТекстЗапроса);

КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьТекстЗапроса(Команда)
	
	ТекстЗапроса = "";
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотра(Команда)
	
	ЭлементыСкрыты = БиблиотекаКартинок.ПоказатьПароль;
	ЭлементыВидны =  БиблиотекаКартинок.СкрытьПароль;
	
	Элементы.РежимПросмотра.Картинка = ?(Элементы.РежимПросмотра.Картинка = ЭлементыВидны, ЭлементыСкрыты, ЭлементыВидны);
	Элементы.ГруппаТекстЗапроса.Видимость = ?(Элементы.РежимПросмотра.Картинка = ЭлементыВидны, Ложь, Истина);
	Элементы.ГруппаНастройки.Видимость = Элементы.ГруппаТекстЗапроса.Видимость И НЕ УпрощенныйРежим;
	
КонецПроцедуры     

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	КонструкторЗапроса = Новый КонструкторЗапроса(СокрЛП(ТекстЗапроса));
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса", ЭтотОбъект);
	КонструкторЗапроса.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьАнализНаСервере(РазбираемыйТекстЗапроса)
	
	ПоляВыбора.Очистить();
	ТипыОбъектов.Очистить();
	ЭтотОбъект["ПраваДокументы"].Очистить(); 
	
	СтруктураИменТаблиц = Новый Структура("ПраваБизнесПроцессы, ПраваВнешниеИсточникиДанных, ПраваДокументы, ПраваЖурналыДокументов, ПраваЗадачи, ПраваКонстанты, ПраваПланыВидовРасчета, ПраваПланыВидовХарактеристик, ПраваПланыОбмена, ПраваПланыСчетов, ПраваРегистрыБухгалтерии, ПраваРегистрыНакопления, ПраваРегистрыРасчета, ПраваРегистрыСведений, ПраваСправочники");
	Для Каждого ИмяТаблицы Из СтруктураИменТаблиц Цикл
		ЭтотОбъект[ИмяТаблицы.Ключ].Очистить();
	КонецЦикла;
		
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(РазбираемыйТекстЗапроса);
	
	Для Каждого Запрос Из СхемаЗапроса.ПакетЗапросов Цикл
		
		Для Каждого Оператор Из Запрос.Операторы Цикл
			
			// Заполняем типы выбираемых полей
			Для Каждого ВыбираемоеПоле Из Оператор.ВыбираемыеПоля Цикл
				
				Если СтрНайти(ВыбираемоеПоле, " ")
					ИЛИ СтрНайти(ВыбираемоеПоле, Символы.ПС)
					ИЛИ СтрНайти(ВыбираемоеПоле, Символы.Таб)
					ИЛИ СтрНайти(ВыбираемоеПоле, "(")
					ИЛИ СтрНайти(ВыбираемоеПоле, ")")
					ИЛИ СтрНайти(ВыбираемоеПоле, "-")
					Тогда
					
					ЧастиПоляСУсловием = ПолучитьЧастиПоляСУсловием(ВыбираемоеПоле);
					
					МассивПолей = Новый Массив;
					
					Для Каждого ЧастьПоляСУсловием Из ЧастиПоляСУсловием Цикл
						
						Если СтрРазделить(ЧастьПоляСУсловием, ".").Количество() > 1 Тогда
							ЗаменитьИточникВыбираемогоПоля(ЧастьПоляСУсловием, Оператор.Источники); 
							ДобавитьПолеВСписок(ЧастьПоляСУсловием)
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					Если СтрРазделить(ВыбираемоеПоле, ".", Ложь).Количество() > 1 Тогда 
						ЗаменитьИточникВыбираемогоПоля(ВыбираемоеПоле, Оператор.Источники);
						ДобавитьПолеВСписок(ВыбираемоеПоле)
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПоляВыбора.СортироватьПоПредставлению();
	
	Для Каждого ПолеВыбора Из ПоляВыбора Цикл
		РазобратьСтроку(ПолеВыбора.Значение);
	КонецЦикла;
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры
                                                            
&НаСервере                                                                                               
Функция ПолучитьЧастиПоляСУсловием(ВыбираемоеПоле)
	
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, " ", "#");
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, Символы.Таб, "#");
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, Символы.ПС, "#");
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "(", "#");
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, ")", "#");
	ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "-", "#");
	
	Если НЕ СтрНайти(ВыбираемоеПоле, "Справочник.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "Документ.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "РегистрНакопления.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "РегистрСведений.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "РегистрБухгалтерии.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "РегистрРасчета.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "Перечисление.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "Константа.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "Задача.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "ПланОбмена.") = 0
		ИЛИ НЕ СтрНайти(ВыбираемоеПоле, "КритерийОтбора.") = 0
		Тогда
		
		ПозицияНачала = Неопределено;
		
		Если НЕ СтрНайти(ВыбираемоеПоле, "Справочник.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "Справочник.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "Документ.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "Документ.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "РегистрНакопления.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "РегистрНакопления.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "РегистрСведений.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "РегистрСведений.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "РегистрБухгалтерии.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "РегистрБухгалтерии.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "РегистрРасчета.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "РегистрРасчета.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "Перечисление.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "Перечисление.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "Константа.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "Константа.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "Задача.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "Задача.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "ПланОбмена.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "ПланОбмена.");
		ИначеЕсли НЕ СтрНайти(ВыбираемоеПоле, "КритерийОтбора.") = 0 Тогда
			ПозицияНачала = СтрНайти(ВыбираемоеПоле, "КритерийОтбора.");
		КонецЕсли;
		
		Если ПозицияНачала = Неопределено Тогда
			Возврат СтрРазделить(ВыбираемоеПоле, "#", Ложь);	
		КонецЕсли;
		
		ПозицияНачала = ПозицияНачала - 1;
		
		Если Сред(ВыбираемоеПоле, ПозицияНачала, 1) = " "
			ИЛИ Сред(ВыбираемоеПоле, ПозицияНачала, 1) = "#"
			ИЛИ Сред(ВыбираемоеПоле, ПозицияНачала, 1) = Символы.Таб
			ИЛИ Сред(ВыбираемоеПоле, ПозицияНачала, 1) = Символы.ПС 
			Тогда
			
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "Справочник.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "Документ.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "РегистрНакопления.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "РегистрСведений.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "РегистрБухгалтерии.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "РегистрРасчета.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "Перечисление.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "Константа.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "Задача.", "#");
			ВыбираемоеПоле = СтрЗаменить(ВыбираемоеПоле, "КритерийОтбора.", "#");
			
			ПолучитьЧастиПоляСУсловием(ВыбираемоеПоле);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат СтрРазделить(ВыбираемоеПоле, "#", Ложь);
	
КонецФункции

&НаСервере
Процедура ЗаменитьИточникВыбираемогоПоля(ВыбираемоеПоле, Источники)
	
	ЧастиВыбираемогоПоля = СтрРазделить(ВыбираемоеПоле, ".", Ложь);
	
	Если ЧастиВыбираемогоПоля.Количество() < 2 Тогда // Полагаем, что это параметр или примитивный тип
		Возврат;
	КонецЕсли;
	
	НайденныйИсточник = Источники.НайтиПоПсевдониму(ЧастиВыбираемогоПоля[0]);
	Если НайденныйИсточник = Неопределено Тогда
		Сообщить("Не найден источник значения: " + ВыбираемоеПоле);
		Возврат;
	КонецЕсли;
	
	Источник = НайденныйИсточник.Источник;
	Если ТипЗнч(Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
		ТекстВложенногоЗапроса = Источник.Запрос.ПолучитьТекстЗапроса();
		ВыполнитьАнализНаСервере(ТекстВложенногоЗапроса);
	Иначе
		ЧастиВыбираемогоПоля[0] = Источник.ИмяТаблицы;
	КонецЕсли;
	
	ВыбираемоеПоле = СтрСоединить(ЧастиВыбираемогоПоля, ".");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВСписок(Поле)
	
	Поле = УстановитьКорректноеИмяБазовогоТипа(Поле);
	
	Если ПоляВыбора.НайтиПоЗначению(Поле) = Неопределено Тогда
		ПоляВыбора.Добавить(Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьКорректноеИмяБазовогоТипа(Поле)

	ЧастиСтроки = СтрРазделить(Поле, ".");
	
	ТипИсточника = ЧастиСтроки[0];
	
	Если ТипИсточника = "КритерийОтбора" Тогда
		ТипИсточника = "КритерииОтбора";
	ИначеЕсли ТипИсточника = "ПланОбмена" Тогда
		ТипИсточника = "ПланыОбмена";
	ИначеЕсли ТипИсточника = "Константа" Тогда
		ТипИсточника = "Константы";
	ИначеЕсли ТипИсточника = "Справочник" Тогда
		ТипИсточника = "Справочники";
	ИначеЕсли ТипИсточника = "Документ" Тогда
		ТипИсточника = "Документы";
	ИначеЕсли ТипИсточника = "ЖурналДокументов" Тогда
		ТипИсточника = "ЖурналыДокументов";
	ИначеЕсли ТипИсточника = "Перечисление" Тогда
		ТипИсточника = "Перечисления";
	ИначеЕсли ТипИсточника = "ПланВидовХарактеристик" Тогда
		ТипИсточника = "ПланыВидовХарактеристик";
	ИначеЕсли ТипИсточника = "РегистрСведений" Тогда
		ТипИсточника = "РегистрыСведений";
	ИначеЕсли ТипИсточника = "РегистрНакопления" Тогда
		ТипИсточника = "РегистрыНакопления";
	ИначеЕсли ТипИсточника = "БизнесПроцесс" Тогда
		ТипИсточника = "БизнесПроцессы";
	ИначеЕсли ТипИсточника = "РегистрБухгалтерии" Тогда
		ТипИсточника = "РегистрыБухгалтерии";
	ИначеЕсли ТипИсточника = "Задача" Тогда
		ТипИсточника = "Задачи";
	ИначеЕсли ТипИсточника = "ВнешнийИсточникДанных" Тогда
		ТипИсточника = "сфпВнешнийИсточникДанныхИсторииЗвонков";
	ИначеЕсли ТипИсточника = "ПланСчетов" Тогда
		ТипИсточника = "ПланыСчетов";
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдет тип источника: " + ТипИсточника;
		Сообщение.Сообщить();
	КонецЕсли;
	
	ЧастиСтроки[0] = ТипИсточника;
	
	Возврат СтрСоединить(ЧастиСтроки, ".");
	
КонецФункции

&НаСервере
Процедура РазобратьСтроку(Строка)

	ЧастиСтроки = СтрРазделить(Строка, ".");
	
	БазовыйТипМетаданных = ЧастиСтроки[0];
	ИмяОбъекта = ЧастиСтроки[1];
	
	Попытка
		ОбъектМетаданных = Метаданные[БазовыйТипМетаданных][ИмяОбъекта];
	Исключение
		Сообщить("Пропуск метаданных: " + БазовыйТипМетаданных + ". Объект: " + ИмяОбъекта);
		Возврат;
	КонецПопытки;

	ЧастиСтроки.Удалить(0);
	ЧастиСтроки.Удалить(0); 
	
	Индекс = 0;
	
	//Если БазовыйТипМетаданных = "РегистрыСведений"
	//	ИЛИ БазовыйТипМетаданных = "РегистрыНакопления"
	//	ИЛИ БазовыйТипМетаданных = "РегистрыБухгалтерии"
	//	ИЛИ БазовыйТипМетаданных = "РегистрыРасчета"
	//	Тогда
	//	
	//	Для Каждого Тип Из ОбъектМетаданных.СтандартныеРеквизиты.Регистратор.Тип.Типы() Цикл 
	//		ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс, ЧастиСтроки);	
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	Пока Индекс <= ЧастиСтроки.Количество() - 1 Цикл
		
		ПолучитьОбъектыМетаданных(ОбъектМетаданных, Индекс, ЧастиСтроки);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПолучитьОбъектыМетаданных(ОбъектМетаданных, Индекс, ЧастиСтроки)
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БазовыйТипОбъекта = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
	
	Если БазовыйТипОбъекта = "Перечисления" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект["Права" + БазовыйТипОбъекта].НайтиСтроки(Новый Структура("ПолноеИмя", ОбъектМетаданных.ПолноеИмя())).Количество() Тогда
		
		НС = ЭтотОбъект["Права" + БазовыйТипОбъекта].Добавить();
		НС.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		НС.ИмяОбъекта = ОбъектМетаданных.Синоним;
		
		Для Каждого Право Из ЭтотОбъект["СписокПрав_" + БазовыйТипОбъекта] Цикл
			
			Если НЕ Право.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			НС[Право.Значение] = ПроверитьРолиПользователя(ОбъектМетаданных, Право.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Индекс > ЧастиСтроки.Количество() - 1 Тогда
		Возврат;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////
	Если БазовыйТипОбъекта = "Константы" Тогда  
		
		Для Каждого Тип Из ОбъектМетаданных.Тип.Типы() Цикл 
			ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);
		КонецЦикла;
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "КритерииОтбора" Тогда // Состав  
		
		НайденныйОбъект = Неопределено;
		
		КоллекцияЗначенийСвойстваОбъектаМетаданных = ОбъектМетаданных.Состав;
		
		Для Каждого ЗначениеСвойстваОбъектаМетаданных Из КоллекцияЗначенийСвойстваОбъектаМетаданных Цикл 
			
			Для Каждого Тип Из ЗначениеСвойстваОбъектаМетаданных.Тип.Типы() Цикл 
				ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);
			КонецЦикла;
			
		КонецЦикла;;                      
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "РегистрыНакопления" // Измерения, Ресурсы, Реквизиты 
		ИЛИ БазовыйТипОбъекта = "РегистрыСведений"
		ИЛИ БазовыйТипОбъекта = "РегистрыБухгалтерии"
		ИЛИ БазовыйТипОбъекта = "РегистрыРасчета"
		Тогда
		
		НайденныйОбъект = Неопределено;
		
		МассивИменКоллекций = Новый Массив;
		МассивИменКоллекций.Добавить("Измерения");
		МассивИменКоллекций.Добавить("Ресурсы");
		МассивИменКоллекций.Добавить("Реквизиты");
		
		Если ЧастиСтроки[Индекс] = "Регистратор" Тогда 
			Для Каждого Тип Из ОбъектМетаданных.СтандартныеРеквизиты.Регистратор.Тип.Типы() Цикл 
				ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого ИмяКоллекции Из МассивИменКоллекций Цикл 
			
			ЭтоВиртуальнаяТаблица = Ложь;
			ИмяВиртуальнойТаблицы = "";
			
			Если ЧастиСтроки[Индекс] = "ОстаткиИОбороты"
				ИЛИ ЧастиСтроки[Индекс] = "Остатки" 
				ИЛИ ЧастиСтроки[Индекс] = "Обороты" 
				ИЛИ ЧастиСтроки[Индекс] = "СрезПервых" 
				ИЛИ ЧастиСтроки[Индекс] = "СрезПоследних" 
				ИЛИ ЧастиСтроки[Индекс] = "ДвиженияССубконто" 
				ИЛИ ЧастиСтроки[Индекс] = "Обороты" 
				ИЛИ ЧастиСтроки[Индекс] = "ОборотыДтКт" 
				ИЛИ ЧастиСтроки[Индекс] = "Субконто" 
				Тогда
				
				ЭтоВиртуальнаяТаблица = Истина;
				ИмяВиртуальнойТаблицы = ЧастиСтроки[Индекс];
				
				Продолжить;
				
			КонецЕсли;
			
			НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
			
			Если НЕ НайденныйОбъект = Неопределено Тогда
				
				Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
					ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "Задачи" Тогда // Измерения, Ресурсы, Реквизиты  
		
		НайденныйОбъект = Неопределено;
		
		МассивИменКоллекций = Новый Массив;
		МассивИменКоллекций.Добавить("РеквизитыАдресации");
		МассивИменКоллекций.Добавить("Реквизиты");
		МассивИменКоллекций.Добавить("ТабличныеЧасти");
		
		Для Каждого ИмяКоллекции Из МассивИменКоллекций Цикл 
			
			Если ИмяКоллекции = "ТабличныеЧасти" Тогда
				НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
				Если НЕ НайденныйОбъект = Неопределено Тогда
					
					Если НЕ Индекс < ЧастиСтроки.Количество() - 1 Тогда
						Продолжить;
					КонецЕсли;
					
					НайденныйОбъект = НайденныйОбъект.Реквизиты.Найти(ЧастиСтроки[Индекс + 1]);
					
					Если НЕ НайденныйОбъект = Неопределено Тогда
						
						Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
							ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 2, ЧастиСтроки);	
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
			КонецЕсли;
			
			Если НЕ НайденныйОбъект = Неопределено Тогда
				
				Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
					ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;                      
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "ВнешниеИсточникиДанных" Тогда // Измерения, Ресурсы, Реквизиты  
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "Справочники"
		ИЛИ БазовыйТипОбъекта = "Документы"   
		ИЛИ БазовыйТипОбъекта = "ПланыОбмена"   
		ИЛИ БазовыйТипОбъекта = "БизнесПроцессы"   
		ИЛИ БазовыйТипОбъекта = "ЖурналыДокументов"   
		ИЛИ БазовыйТипОбъекта = "ПланыВидовХарактеристик" Тогда 
		
		НайденныйОбъект = Неопределено;
		
		МассивИменКоллекций = Новый Массив;
		МассивИменКоллекций.Добавить("Реквизиты");
		МассивИменКоллекций.Добавить("ТабличныеЧасти");
		
		Если БазовыйТипОбъекта = "ЖурналыДокументов" Тогда 
			МассивИменКоллекций = Новый Массив;
			МассивИменКоллекций.Добавить("Графы");
		КонецЕсли;
		
		Для Каждого ИмяКоллекции Из МассивИменКоллекций Цикл 
			
			Если ИмяКоллекции = "ТабличныеЧасти" Тогда
				НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
				Если НЕ НайденныйОбъект = Неопределено Тогда
					
					Если НЕ Индекс < ЧастиСтроки.Количество() - 1 Тогда
						Продолжить;
					КонецЕсли;
					
					НайденныйОбъект = НайденныйОбъект.Реквизиты.Найти(ЧастиСтроки[Индекс + 1]);
					
					Если НЕ НайденныйОбъект = Неопределено Тогда
						
						Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
							ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 2, ЧастиСтроки);	
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
			КонецЕсли;
			
			Если НЕ НайденныйОбъект = Неопределено Тогда
				
				Если БазовыйТипОбъекта = "ЖурналыДокументов" Тогда 
					
					Для Каждого Ссылка Из НайденныйОбъект.Ссылки Цикл
						
						Для Каждого Тип Из Ссылка.Тип.Типы() Цикл 
							ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
						КонецЦикла;
						
					КонецЦикла;
					
				Иначе
					
					Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
						ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;                     
		
		//////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли БазовыйТипОбъекта = "ПланыСчетов" Тогда // Реквизиты, ПризнакиУчета, ПризнакиУчетаСубконто   
		
		НайденныйОбъект = Неопределено;
		
		МассивИменКоллекций = Новый Массив;
		МассивИменКоллекций.Добавить("Реквизиты");
		МассивИменКоллекций.Добавить("ПризнакиУчета");
		МассивИменКоллекций.Добавить("ПризнакиУчетаСубконто");
		
		Для Каждого Тип Из ОбъектМетаданных.ВидыСубконто.Тип.Типы() Цикл 
			ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
		КонецЦикла;
		
		Для Каждого ИмяКоллекции Из МассивИменКоллекций Цикл 
			
			НайденныйОбъект = ОбъектМетаданных[ИмяКоллекции].Найти(ЧастиСтроки[Индекс]);
			
			Если НЕ НайденныйОбъект = Неопределено Тогда
				
				Для Каждого Тип Из НайденныйОбъект.Тип.Типы() Цикл 
					ПолучитьОбъектыМетаданных(Метаданные.НайтиПоТипу(Тип), Индекс + 1, ЧастиСтроки);	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;                      
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПравами

&НаСервере
Функция ПроверитьРолиПользователя(ОбъектМета, Право)
	
	МассивВсехРолей = Новый Массив;
	
	Для Каждого МетаРоль Из Метаданные.Роли Цикл
		МассивВсехРолей.Добавить(МетаРоль);
	КонецЦикла;
	
	МассивРолейНаПроверку = Новый Массив;
	
	Для Каждого МетаРоль Из МассивВсехРолей Цикл
		
		Если ПравоДоступа(Право, ОбъектМета, МетаРоль) Тогда	
			МассивРолейНаПроверку.Добавить(МетаРоль);	
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивРолейНаПроверку.Количество() Тогда
		
		Для Каждого СтрокаРоли Из МассивРолейНаПроверку Цикл
			
			ПризнакНаличияРоли = ЕстьРоль(СтрокаРоли.Имя, Пользователь);
			
			Если ПризнакНаличияРоли Тогда
				Возврат Истина;
			Иначе
				ПризнакНаличияРоли = ЕстьРольПользователя(СтрокаРоли.Имя, Пользователь);
			КонецЕсли; 
			
			Если ПризнакНаличияРоли Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;
		
КонецФункции    
        
&НаСервере
Функция ЕстьРоль(ИмяРоли, Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Поле1,
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	|	И ГруппыДоступаПользователи.Пользователь В
	|			(ВЫБРАТЬ
	|				ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
	|			ИЗ
	|				Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ГДЕ
	|				ГруппыПользователейСостав.Пользователь = &Пользователь)";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции

&НаСервере
Функция ЕстьРольПользователя(ИмяРоли, Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	|	И ГруппыДоступаПользователи.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Пользователь
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
	|	И ГруппыПользователейСостав.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции 

#КонецОбласти

#Область ОбработчикиЗаполненияФормы

&НаСервере
Процедура ДобавитьСпискиПрав()
	
	СписокБазовыхТипов = ПолучитьСписокБазовыхТипов();
	
	ДобавляемыРеквизиты = Новый Массив;
	
	Для Каждого ИмяСписка Из СписокБазовыхТипов Цикл
		
		ИмяСписка = "СписокПрав_" + ИмяСписка;
		
		ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы(ИмяСписка, Новый ОписаниеТипов("СписокЗначений")));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыРеквизиты);
	
	Для Каждого ИмяБазовогоТипа Из СписокБазовыхТипов Цикл
		
		ИмяСписка = "СписокПрав_" + ИмяБазовогоТипа;
		
		Группа = ЭтаФорма.Элементы.Добавить("Группа" + ИмяСписка, Тип("ГруппаФормы"), Элементы.ГруппаНастройки);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = ИмяБазовогоТипа;
		Группа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		Группа.ОтображатьЗаголовок = Истина; 
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Группа.РастягиватьПоГоризонтали = Истина;
		Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		Группа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		Группа.Скрыть();

		ТаблицаСписка = Элементы.Добавить(ИмяСписка, Тип("ТаблицаФормы"), Группа);
		ТаблицаСписка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ТаблицаСписка.ПутьКДанным = ИмяСписка;
        ТаблицаСписка.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаСписка.УстановитьДействие("ПриИзменении", "СписокПравПриИзменении");
		
		КолонкаПометки = Элементы.Добавить(ИмяСписка + "Пометка", Тип("ПолеФормы"), ТаблицаСписка);
		КолонкаПометки.Вид = ВидПоляФормы.ПолеФлажка;
		КолонкаПометки.ПутьКДанным = ИмяСписка + ".Пометка";
  
		КолонкаЗначения = Элементы.Добавить(ИмяСписка + "Значение", Тип("ПолеФормы"), ТаблицаСписка);
		КолонкаЗначения.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаЗначения.ПутьКДанным = ИмяСписка + ".Значение";

		КолонкаПредставления = Элементы.Добавить(ИмяСписка + "Представление", Тип("ПолеФормы"), ТаблицаСписка);
		КолонкаПредставления.Вид = ВидПоляФормы.ПолеВвода;
		КолонкаПредставления.ПутьКДанным = ИмяСписка + ".Представление";
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиПрав()
	
	// Документы
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Проведение", "Проведение", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ОтменаПроведения", "Отмена проведения", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеПроведение", "Интерактивное проведение", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеПроведениеНеоперативное", "Интерактивное проведение неоперативное", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивнаяОтменаПроведения", "Интерактивная птмена проведения", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИнтерактивноеИзменениеПроведенных", "Интерактивное изменение проведенных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.Документ);
	ЭтотОбъект["СписокПрав_Документы"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.Документ);
	
	// Справочники
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеУдалениеПредопределенныхДанных", "Интерактивное удаление предопределенных данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивнаяПометкаУдаленияПредопределенныхДанных", "Интерактивная пометка на удаление предопределенных данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных", "Интерактивное снятие пометки удаления предопределенных данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИнтерактивноеУдалениеПомеченныхПредопределенныхДанных", "Интерактивное удаление помеченных предопределенных данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.Справочник);
	ЭтотОбъект["СписокПрав_Справочники"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.Справочник);

	// РегистрыСведений
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("УправлениеИтогами", "Управление итогами", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	ЭтотОбъект["СписокПрав_РегистрыСведений"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.РегистрСведений);
	
	// РегистрыНакопления
	ЭтотОбъект["СписокПрав_РегистрыНакопления"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.РегистрНакопления);
	ЭтотОбъект["СписокПрав_РегистрыНакопления"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.РегистрНакопления);
	ЭтотОбъект["СписокПрав_РегистрыНакопления"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.РегистрНакопления);
	ЭтотОбъект["СписокПрав_РегистрыНакопления"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.РегистрНакопления);
	ЭтотОбъект["СписокПрав_РегистрыНакопления"].Добавить("УправлениеИтогами", "Управление итогами", Истина, БиблиотекаКартинок.РегистрНакопления);
	
	// РегистрыБухгалтерии
	ЭтотОбъект["СписокПрав_РегистрыБухгалтерии"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.РегистрБухгалтерии);
	ЭтотОбъект["СписокПрав_РегистрыБухгалтерии"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.РегистрБухгалтерии);
	ЭтотОбъект["СписокПрав_РегистрыБухгалтерии"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.РегистрБухгалтерии);
	ЭтотОбъект["СписокПрав_РегистрыБухгалтерии"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.РегистрБухгалтерии);
	ЭтотОбъект["СписокПрав_РегистрыБухгалтерии"].Добавить("УправлениеИтогами", "Управление итогами", Истина, БиблиотекаКартинок.РегистрБухгалтерии);
	
	// Константы
	ЭтотОбъект["СписокПрав_Константы"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.Константа);
	ЭтотОбъект["СписокПрав_Константы"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.Константа);
	
	// ЖурналыДокументов
	ЭтотОбъект["СписокПрав_ЖурналыДокументов"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.ЖурналДокументов);
	ЭтотОбъект["СписокПрав_ЖурналыДокументов"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.ЖурналДокументов);
	
	// ПланыВидовХарактеристик
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеУдалениеПредопределенныхДанных", "Интерактивное удаление предопределенных данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивнаяПометкаУдаленияПредопределенныхДанных", "Интерактивная пометка на удаление предопределенных данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных", "Интерактивное снятие пометки удаления предопределенных данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИнтерактивноеУдалениеПомеченныхПредопределенныхДанных", "Интерактивное удаление помеченных предопределенных данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);
	ЭтотОбъект["СписокПрав_ПланыВидовХарактеристик"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.ПланВидовХарактеристик);

	// ПланыСчетов
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеУдалениеПредопределенныхДанных", "Интерактивное удаление предопределенных данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивнаяПометкаУдаленияПредопределенныхДанных", "Интерактивная пометка на удаление предопределенных данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеСнятиеПометкиУдаленияПредопределенныхДанных", "Интерактивное снятие пометки удаления предопределенных данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИнтерактивноеУдалениеПомеченныхПредопределенныхДанных", "Интерактивное удаление помеченных предопределенных данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	ЭтотОбъект["СписокПрав_ПланыСчетов"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.ПланСчетов);
	
	// ПланыОбмена
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.ПланОбмена);
	ЭтотОбъект["СписокПрав_ПланыОбмена"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.ПланОбмена);

	// БизнесПроцессы
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивнаяАктивация", "Интерактивная активация", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("Старт", "Старт", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИнтерактивныйСтарт", "Интерактивный старт", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);
	ЭтотОбъект["СписокПрав_БизнесПроцессы"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.БизнесПроцесс);

	// Задачи
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Чтение", "Чтение", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Добавление", "Добавление", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Изменение", "Изменение", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Удаление", "Удаление", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Просмотр", "Просмотр", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивноеДобавление", "Интерактивное добавление", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Редактирование", "Редактирование", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивноеУдаление", "Интерактивное удаление", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивнаяПометкаУдаления", "Интерактивная пометка удаления", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивноеСнятиеПометкиУдаления", "Интерактивное снятие пометки удаления", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивноеУдалениеПомеченных", "Интерактивное удаление помеченных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ВводПоСтроке", "Ввод по строке", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивнаяАктивация", "Интерактивная активация", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("Выполнение", "Выполнение", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИнтерактивноеВыполнение", "Интерактивное выполнение", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ЧтениеИсторииДанных", "Чтение истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ЧтениеИсторииДанныхОтсутствующихДанных", "Чтение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИзменениеИсторииДанных", "Изменение истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИзменениеИсторииДанныхОтсутствующихДанных", "Изменение истории данных отсутствующих данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИзменениеНастроекИсторииДанных", "Изменение настроек истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ИзменениеКомментарияВерсииИсторииДанных", "Изменение комментария версии истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ПросмотрИсторииДанных", "Просмотр истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("РедактированиеКомментарияВерсииИсторииДанных", "Редактирование комментария версии истории данных", Истина, БиблиотекаКартинок.Задача);
	ЭтотОбъект["СписокПрав_Задачи"].Добавить("ПереходНаВерсиюИсторииДанных", "Переход на версию истории данных", Истина, БиблиотекаКартинок.Задача);

КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуМета(Имя)
	
	СоответствиеКартинок = Новый Соответствие; 
	 
	СтрокаИмен = "Справочники,Документы,РегистрыСведений,РегистрыНакопления,РегистрыБухгалтерии,РегистрыРасчета,Константы," +
		"ЖурналыДокументов,ПланыВидовХарактеристик,ПланыСчетов,ПланыВидовРасчета,БизнесПроцессы," +
		"Задачи,ВнешниеИсточникиДанных,ПланыОбмена";
	СтрокаКартинок = "Справочник,Документ,РегистрСведений,РегистрНакопления,РегистрБухгалтерии,РегистрРасчета,Константа," +
		"ЖурналДокументов,ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчета,БизнесПроцесс," +
		"Задача,ВнешнийИсточникДанных,ПланОбмена"; 
	
	МассивИмен = СтрРазделить(СтрокаИмен, ",");
	МассивКартинок = СтрРазделить(СтрокаКартинок, ",");
	
	Итер = 0;
	Пока Итер < МассивИмен.Количество() Цикл
		СоответствиеКартинок.Вставить(МассивИмен[Итер], МассивКартинок[Итер]); 
		Итер = Итер + 1;
	КонецЦикла;
	
	Возврат СоответствиеКартинок.Получить(Имя);
	
КонецФункции

&НаСервере
Процедура СоздатьТаблицыЗначений()
	
	СписокБазовыхТипов = ПолучитьСписокБазовыхТипов();
	
	ДобавляемыРеквизиты = Новый Массив;
	
	Для Каждого Имя Из СписокБазовыхТипов Цикл
		
		ИмяТаблицы = "Права" + Имя;
		ИмяКолонки = "ПолноеИмя";
		ИмяМетаОбъекта = "ИмяОбъекта";
		
		ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Строка"), ИмяТаблицы));
		ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы(ИмяМетаОбъекта, Новый ОписаниеТипов("Строка"), ИмяТаблицы));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыРеквизиты);
	
	Для Каждого Имя Из СписокБазовыхТипов Цикл
		
		ИмяТаблицы = "Права" + Имя;
		ИмяКолонки = "ПолноеИмя";
		
		//
		ГруппаГоризонт = ЭтаФорма.Элементы.Добавить("ГруппаГоризонт" + ИмяТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаТипыОбъектовИПрава);
		ГруппаГоризонт.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаГоризонт.Заголовок = Имя + "Горизонт";
		ГруппаГоризонт.ОтображатьЗаголовок = Ложь;
		ГруппаГоризонт.Видимость = Ложь;
		
		ДекорацияКартинка = ЭтаФорма.Элементы.Добавить("КартинкаМета" + Имя, Тип("ДекорацияФормы"), ГруппаГоризонт);
		ДекорацияКартинка.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияКартинка.Картинка = БиблиотекаКартинок[ПолучитьКартинкуМета(Имя)];
		ДекорацияКартинка.РазмерКартинки = РазмерКартинки.Растянуть;
		
		ДекорацияИмя = ЭтаФорма.Элементы.Добавить("ЗаголовокМета" + Имя, Тип("ДекорацияФормы"), ГруппаГоризонт);
		ДекорацияИмя.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияИмя.Заголовок = Имя; 
		ДекорацияИмя.Шрифт = Новый Шрифт(,, Истина);
		ДекорацияИмя.ЦветТекста = WebЦвета.ЗеленыйЛес;
		//
		
		Группа = ЭтаФорма.Элементы.Добавить("Группа" + ИмяТаблицы, Тип("ГруппаФормы"), Элементы.ГруппаТипыОбъектовИПрава);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = Имя;
		Группа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		Группа.ОтображатьЗаголовок = Ложь; 
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Группа.РастягиватьПоГоризонтали = Истина;
		Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		
		ТаблицаФормы = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), Группа);
		ТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ТаблицаФормы.ПутьКДанным = ИмяТаблицы;
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Авто;
		ТаблицаФормы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
		ТаблицаФормы.АвтоМаксимальнаяВысота = Ложь;
		ТаблицаФормы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
		ТаблицаФормы.ТолькоПросмотр = Истина;
		ТаблицаФормы.Видимость = Ложь;
		
		НовыйЭлемент = Элементы.Добавить(ИмяТаблицы + ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы + "." + ИмяКолонки; 
		НовыйЭлемент.Видимость = Ложь;
		
		НовыйЭлемент = Элементы.Добавить(ИмяТаблицы + "ИмяОбъекта", Тип("ПолеФормы"), ТаблицаФормы);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ИмяТаблицы +  "." + "ИмяОбъекта";
		НовыйЭлемент.Заголовок = "Имя объекта";
		
		СоздатьКолонкиТаблиц("СписокПрав_" + Имя, "Права" + Имя);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонкиТаблицы(ИмяСписка)

	СписокПрав = ЭтотОбъект[ИмяСписка];
	
	УдаляемыеРеквизиты = Новый Массив;

	ИмяТаблицы = "Права" + СтрРазделить(ИмяСписка, "_")[1];
	
	РеквизитыТаблицы = ПолучитьРеквизиты(ИмяТаблицы);
	
	Для Каждого РеквизитТаблицы Из РеквизитыТаблицы Цикл
		
		Если РеквизитТаблицы.Имя = "ПолноеИмя" ИЛИ РеквизитТаблицы.Имя = "ИмяОбъекта" Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Удалить(Элементы[РеквизитТаблицы.Путь + РеквизитТаблицы.Имя]);
		
		УдаляемыеРеквизиты.Добавить(РеквизитТаблицы.Путь + "." + РеквизитТаблицы.Имя);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	СоздатьКолонкиТаблиц(ИмяСписка, РеквизитТаблицы.Путь);
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиТаблиц(ИмяСписка, Путь)
	
	СписокПрав = ЭтотОбъект[ИмяСписка];
	
	ДобавляемыРеквизиты = Новый Массив;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	Для Каждого Право Из СписокПрав Цикл
		Если Право.Пометка Тогда 
			ДобавляемыРеквизиты.Добавить(Новый РеквизитФормы(Право.Значение, ОписаниеТипов, Путь));
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыРеквизиты);
	
	Для Каждого Право Из СписокПрав Цикл
		Если Право.Пометка Тогда 
			НовыйЭлементФормы = Элементы.Добавить(Путь + Право.Значение, Тип("ПолеФормы"), Элементы[Путь]);
			НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеКартинки;
			НовыйЭлементФормы.ПутьКДанным = Путь + "." + Право.Значение;
			НовыйЭлементФормы.Заголовок = Право.Представление;
			НовыйЭлементФормы.КартинкаЗначений = БиблиотекаКартинок.ОформлениеФлажок;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовФормы()
	
	СписокБазовыхТипов = ПолучитьСписокБазовыхТипов();
	
	Для Каждого Имя Из СписокБазовыхТипов Цикл
		ИмяТаблицы = "Права" + Имя;    
		ТаблицаЗаполнена = ЭтотОбъект[ИмяТаблицы].Количество();
		Элементы[ИмяТаблицы].Видимость = ТаблицаЗаполнена;
		Элементы["ГруппаГоризонт" + ИмяТаблицы].Видимость = ТаблицаЗаполнена;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокБазовыхТипов()
	
	СписокБазовыхТипов = Новый Массив;
	СписокБазовыхТипов.Добавить("Справочники");
	СписокБазовыхТипов.Добавить("Документы");
	СписокБазовыхТипов.Добавить("РегистрыСведений");
	СписокБазовыхТипов.Добавить("РегистрыНакопления");
	СписокБазовыхТипов.Добавить("РегистрыБухгалтерии");
	СписокБазовыхТипов.Добавить("РегистрыРасчета");
	СписокБазовыхТипов.Добавить("Константы");
	СписокБазовыхТипов.Добавить("ЖурналыДокументов");
	СписокБазовыхТипов.Добавить("ПланыВидовХарактеристик");
	СписокБазовыхТипов.Добавить("ПланыСчетов");
	СписокБазовыхТипов.Добавить("ПланыВидовРасчета");
	СписокБазовыхТипов.Добавить("БизнесПроцессы");
	СписокБазовыхТипов.Добавить("Задачи");
	СписокБазовыхТипов.Добавить("ВнешниеИсточникиДанных");
	СписокБазовыхТипов.Добавить("ПланыОбмена");
	
	Возврат СписокБазовыхТипов;
	
КонецФункции

#КонецОбласти
  
#Область КонструкторЗарпоса

&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(НовыйТекстЗапроса, ДополнительныеПараметры) Экспорт
	
	Если НовыйТекстЗапроса <> Неопределено Тогда
		
		ТекстЗапроса = НовыйТекстЗапроса;
		
		//ТекущийЗапрос = Объект.Запросы.Получить(ИндексТекущегоЗапроса - 1);
		//
		//Если ТекущийЗапрос.Имя = ИмяЗапросаПоУмолчанию Тогда 
		//	ТекущийЗапрос.Имя = ПолучитьИмяЗапроса(ТекстЗапросаВФорме);
		//КонецЕсли;
		//
		//ТекущийЗапрос.Текст = ТекстЗапросаВФорме;
		//
		//Модифицированность = Истина;
		//
		//ОбновитьФормуКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпрощенныйРежимПриИзменении(Элемент)
	
	СтруктураПрав = Новый Структура("СписокПрав_Документы, СписокПрав_Справочники, СписокПрав_РегистрыСведений, СписокПрав_РегистрыНакопления, СписокПрав_РегистрыБухгалтерии, СписокПрав_Константы, СписокПрав_ЖурналыДокументов, СписокПрав_ПланыВидовХарактеристик, СписокПрав_ПланыСчетов, СписокПрав_ПланыОбмена, СписокПрав_БизнесПроцессы, СписокПрав_Задачи");
	
	Для Каждого ПравоОбъекта Из СтруктураПрав Цикл
		
		Для Каждого Право Из ЭтотОбъект[ПравоОбъекта.Ключ] Цикл
			Право.Пометка = ?(УпрощенныйРежим, ?(Право.Значение = "Чтение" ИЛИ Право.Значение = "Просмотр", УпрощенныйРежим, НЕ УпрощенныйРежим), НЕ УпрощенныйРежим);
		КонецЦикла;
		
		ОбновитьКолонкиТаблицы(ПравоОбъекта.Ключ);
		
	КонецЦикла;  
	
	Элементы.ГруппаНастройки.Видимость = НЕ УпрощенныйРежим И Элементы.ГруппаТекстЗапроса.Видимость;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ВыполнитьАнализНаСервере(ТекстЗапроса);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ВыполнитьАнализНаСервере(ТекстЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВНовомОкне(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТекстЗапроса", ТекстЗапроса);
	ПараметрыОткрытия.Вставить("УпрощенныйРежим", УпрощенныйРежим);
	
	ОткрытьФорму("ВнешняяОбработка.АнализИКонтрольДоступа.Форма.ФормаПарсерЗапроса", ПараметрыОткрытия, ЭтотОбъект); 
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
