#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если НЕ ЗначениеЗаполнено(Параметры.ОбъектПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДоступа = Параметры.ОбъектПроверки;
	
	ЭтоГруппа = ТипЗнч(ОбъектДоступа) = Тип("СправочникСсылка.ГруппыДоступа");
	ЭтоПрофиль = ТипЗнч(ОбъектДоступа) = Тип("СправочникСсылка.ПрофилиГруппДоступа");
	ЭтоРоль = ТипЗнч(ОбъектДоступа) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") ИЛИ ТипЗнч(ОбъектДоступа) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений");
	
	ЭтотОбъект.ТаблицаПользователей.Очистить();
	
	Если ЭтоГруппа Тогда
		
		ЭтотОбъект.Заголовок = "Входящие в группу: " + ОбъектДоступа.Наименование;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		               |ПОМЕСТИТЬ ВТ_Пользователи
		               |ИЗ
		               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		               |		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		               |		ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка
		               |ГДЕ
		               |	ГруппыДоступа.Ссылка = &Группа
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ_Пользователи.Пользователь КАК Группа
		               |ПОМЕСТИТЬ ВТ_ГруппыПользователей
		               |ИЗ
		               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Пользователи КАК ВТ_Пользователи
		               |		ПО (ВТ_Пользователи.Пользователь = ГруппыПользователейСостав.Ссылка)
		               |ГДЕ
		               |	ВТ_Пользователи.Пользователь ССЫЛКА Справочник.ГруппыПользователей
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ГруппыПользователейСостав.Пользователь КАК Пользователь
		               |ИЗ
		               |	ВТ_ГруппыПользователей КАК ВТ_ГруппыПользователей
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		               |		ПО ВТ_ГруппыПользователей.Группа = ГруппыПользователейСостав.Ссылка
		               |ГДЕ
		               |	ГруппыПользователейСостав.Пользователь ССЫЛКА Справочник.Пользователи
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ_Пользователи.Пользователь
		               |ИЗ
		               |	ВТ_Пользователи КАК ВТ_Пользователи
		               |ГДЕ
		               |	ВТ_Пользователи.Пользователь ССЫЛКА Справочник.Пользователи";
		
		Запрос.УстановитьПараметр("Группа", ОбъектДоступа);	
		ЭтотОбъект.ТаблицаПользователей.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Количество = ЭтотОбъект.ТаблицаПользователей.Количество(); 
		
	ИначеЕсли ЭтоПрофиль Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПрофилиГруппДоступаРоли.Роль КАК Пользователь,
					   |	ПрофилиГруппДоступаРоли.Роль.Имя КАК РольИмя
		               |ИЗ
		               |	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		               |ГДЕ
		               |	ПрофилиГруппДоступаРоли.Ссылка = &Профиль";
		
		Запрос.УстановитьПараметр("Профиль", ОбъектДоступа);
		ЭтотОбъект.ТаблицаПользователей.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Количество = ЭтотОбъект.ТаблицаПользователей.Количество();
		
		Элементы.ТаблицаПользователей.КартинкаСтрок = БиблиотекаКартинок.ЗакрытыйКлюч;
		ЭтотОбъект.Заголовок = "Роли состоящие в профиле [" + ОбъектДоступа + "]";
		
	ИначеЕсли ЭтоРоль Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПрофилиГруппДоступаРоли.Ссылка КАК Пользователь,
		|	ПрофилиГруппДоступаРоли.Ссылка.Наименование КАК Ссылка
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль = &Роль";
		
		Запрос.УстановитьПараметр("Роль", ОбъектДоступа);
		ЭтотОбъект.ТаблицаПользователей.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Количество = ЭтотОбъект.ТаблицаПользователей.Количество();
		
		Элементы.ТаблицаПользователей.КартинкаСтрок = БиблиотекаКартинок.Реквизит;
		ЭтотОбъект.Заголовок = "Профили, в которых содержится роль [" + ОбъектДоступа + "]";
		Элементы.ТаблицаПользователейПользователь.Заголовок = "Профили";
		
	Иначе
		
		ЭтотОбъект.Заголовок = "Имеющие роль: " + Метаданные.Роли.Найти(ОбъектДоступа).Синоним;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_Пользователи
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ПО ПрофилиГруппДоступаРоли.Ссылка = ГруппыДоступаПользователи.Ссылка.Профиль
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Пользователи.Пользователь КАК Группа
		|ПОМЕСТИТЬ ВТ_ГруппыПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Пользователи КАК ВТ_Пользователи
		|		ПО (ВТ_Пользователи.Пользователь = ГруппыПользователейСостав.Ссылка)
		|ГДЕ
		|	ВТ_Пользователи.Пользователь ССЫЛКА Справочник.ГруппыПользователей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_ГруппыПользователей КАК ВТ_ГруппыПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ПО ВТ_ГруппыПользователей.Группа = ГруппыПользователейСостав.Ссылка
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь ССЫЛКА Справочник.Пользователи
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Пользователи.Пользователь
		|ИЗ
		|	ВТ_Пользователи КАК ВТ_Пользователи
		|ГДЕ
		|	ВТ_Пользователи.Пользователь ССЫЛКА Справочник.Пользователи";
		
		Запрос.УстановитьПараметр("Роль", ОбъектДоступа);
		ЭтотОбъект.ТаблицаПользователей.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Количество = ЭтотОбъект.ТаблицаПользователей.Количество();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда  
		ОО = Новый ОписаниеОповещения("ПослеВыбораПользователя", ЭтотОбъект, Новый Структура("Пользователь", Элемент.ТекущиеДанные.Пользователь));
		ПоказатьВопрос(ОО, "Перенести пользователя в форму анализа ролей?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Выбор пользователя для отбора");
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.Пользователь) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда                    
		РольСписок = Новый СписокЗначений;
		РольСписок.Добавить(Элемент.ТекущиеДанные.РольИмя, Элемент.ТекущиеДанные.Пользователь);
		ОО = Новый ОписаниеОповещения("ПослеВыбораПользователя", ЭтотОбъект, Новый Структура("Пользователь", РольСписок));
		ПоказатьВопрос(ОО, "Перенести роль в форму анализа ролей?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Выбор роли для отбора");
	КонецЕсли;
	
КонецПроцедуры       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораПользователя(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Закрыть(ДополнительныеПараметры.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
